{
    "2": [
        {
            "code": "ELP101",
            "name": "Introduction to Electrical Engineering",
            "prereqs": "[]",
            "overlap": "",
            "credits": 0,
            "hours": {
                "lecture": 0,
                "tutorial": 0,
                "practical": 0
            },
            "description": "(Laboratory) 1 Credit (0-0-2) CRO (mechanism and usage). KCL, KVL, Network theorem verification. Step/transient response of RL, RC, RLC, circuits. Steady state response of Circuits of sinusoidal excitation. Diode experiment (clipping, clamping and rectification). Basic circuits using opamp. Transformers oC and SC tests. BH loop in an iron core, DC and AC motor – for observation only. A small mini-project.",
            "prereqs_parsed": [],
            "type": "Core"
        },
        {
            "code": "PYP100",
            "name": "Physics Laboratory",
            "prereqs": "[]",
            "overlap": "",
            "credits": 2.0,
            "hours": {
                "lecture": 0,
                "tutorial": 0,
                "practical": 4
            },
            "description": "Experiments based on Design and Study of Power sources, Charging and discharging of a capacitor, Electromagnetic Induction, Phase Measurement. Experiments on geometrical and wave optics including interference, diffraction, dispersion and polarization. Experiments based on mechanics, heat, sound, fluids, resonance, like linear air track, coupled pendulum and oscillators, thermal conductivity, elasticity. Experiments in the area of modern physics, like Planck’s constant, lasers, semiconductor band gap, wave motion, mechanical transmission lines.",
            "prereqs_parsed": [],
            "type": "Core"
        },
        {
            "code": "MCP101",
            "name": "Product Realization through Manufacturing",
            "prereqs": "[]",
            "overlap": "",
            "credits": 2.0,
            "hours": {
                "lecture": 0,
                "tutorial": 0,
                "practical": 4
            },
            "description": "Exposing role of manufacturing processes in product realization; understanding product realization by endeavouring hands on activities; Experience of product realization by undertaking manufacturing exercises and assembly activity in teams.",
            "prereqs_parsed": [],
            "type": "Core"
        },
        {
            "code": "APL100",
            "name": "Engineering Mechanics",
            "prereqs": "[]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "Kinematics, Statics, Equations of Motion, Rigid body dynamics, Introduction to variational mechanics.",
            "prereqs_parsed": [],
            "type": "Core"
        },
        {
            "code": "COL100",
            "name": "Introduction to Computer Science",
            "prereqs": "[]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 2
            },
            "description": "organization of Computing Systems. Concept of an algorithm; termination and correctness. Algorithms to programs: specification, top-down development and stepwise refinement. Problem solving using a functional style; Correctness issues in programming; Efficiency issues in programming; Time and space measures. Procedures, functions. Data types, representational invariants. Encapsulation, abstractions, interaction and modularity. Identifying and exploiting inherent concurrency. Structured style of imperative programming. Introduction to numerical methods. At least one example of large program development.",
            "prereqs_parsed": [],
            "type": "Core"
        },
        {
            "code": "CML101",
            "name": "Introduction to Chemistry",
            "prereqs": "[]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "Basics of rate laws; Complex reactions: consecutive and parallel reactions; Temperature dependence of reaction rates; Reaction mechanisms: steady-state approximation, pre-equilibria, unimolecular reactions; Catalysis; Atomic structure: Schrödinger equation, the hydrogen atom; The chemical bond: simplest molecules H2 + and H2; Vibration of diatomics: harmonic oscillator and Morse potential Stability of organometallic compounds; Metal carbonyls: structure and bonding; Important reactions of organometallic compounds; Homogeneous catalysis; Applications of crystal field theory; An overview of metals in biology; Functions of metalloproteins R/S-Nomenclature; Projection formulas; Mo approaches for the stereochemical outcome of the reactions; Determination of reaction mechanism; Kinetic versus thermodynamic control of the reaction; Trapping of reactive intermediates; Spectroscopic methods of structure determination.",
            "prereqs_parsed": [],
            "type": "Core"
        },
        {
            "code": "MTL101",
            "name": "Linear Algebra and Differential Equations",
            "prereqs": "[]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "Vector spaces over Q, R and C, subspaces, linear independence, linear span of a set of vectors, basis and dimension of a vector space, sum and direct sum. Systems of linear (homogeneous and non-homogeneous) equations, matrices and Gauss elimination, elementary row operations, row space, column space, null space and rank of a matrix. Linear transformation, rank-nullity theorem and its applications, matrix representation of a linear transformation, change of basis and similarity. Eigenvalues and eigenvectors, characteristic and minimal polynomials, Cayley-Hamilton theorem (without proof) and applications. Review of first order differential equations, Picard’s theorem, linear dependence and Wronskian. Dimensionality of space of solutions, linear ODE with constant coefficients of second and higher order, Cauchy-Euler equations, Method of undetermined coefficients and method of variation of parameters. Boundary Value Problems: Sturm- Liouville eigenvalue problems. System of linear differential equations with constant coefficients, fundamental matrix, matrix methods. Power Series and its convergence, power series method, Fourier series, Laplace Transform Method.",
            "prereqs_parsed": [],
            "type": "Core"
        },
        {
            "code": "CMP100",
            "name": "Chemistry Laboratory",
            "prereqs": "[]",
            "overlap": "",
            "credits": 2.0,
            "hours": {
                "lecture": 0,
                "tutorial": 0,
                "practical": 4
            },
            "description": "Experiments involve the following: Titrations, Surface Tension and Viscosity, Potentiometery, Conductometry, Preparation of metal complexes and important organic compounds, Kinetics, Chromatography, Qualitative and quantitative estimation of organic compounds.",
            "prereqs_parsed": [],
            "type": "Core"
        }
    ],
    "3": [
        {
            "code": "ELL205",
            "name": "Signals and Systems",
            "prereqs": "[]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "Motivation & orientation, Classifications of signals & systems, Dynamic representation of LTI systems (discrete & continuous-time systems), Fourier analysis of continuous-time signals & systems, Fourier analysis of discrete-time signals & systems, Nyquist sampling theorem, Laplace transform, The z-transform, Introduction to probability, random variables and stochastic processes.",
            "prereqs_parsed": [],
            "type": "Core"
        },
        {
            "code": "ELL202",
            "name": "Circuit Theory",
            "prereqs": "[ELL101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "overview of network analysis techniques, network theorems, transient and steady-state sinusoidal response. Network graphs and their applications in network analysis. Tellegen’s theorem, two-port networks, Z, Y, h, g, and transmission matrices. Combining two ports in various configurations. Analysis of transmission lines to motivate the scattering matrix. Scattering matrix and its applications in network analysis. Network functions, positive real functions, and network synthesis. Butterworth and Chebyshev approximations. Synthesis of lossless two-port networks. Synthesis of lattice all-pass filters.",
            "prereqs_parsed": [
                [
                    "ELL101"
                ]
            ],
            "type": "Core"
        },
        {
            "code": "COL106",
            "name": "Data Structures & Algorithms",
            "prereqs": "[COL100]",
            "overlap": "",
            "credits": 5.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 4
            },
            "description": "Introduction to object-oriented programming through stacks queues and linked lists. Dictionaries; skip-lists, hashing, analysis of collision resolution techniques. Trees, traversals, binary search trees, optimal and average BSTs. Balanced BST: AVL Trees, 2-4 trees, red-black trees, B-trees. Tries and suffix trees. Priority queues and binary heaps. Sorting: merge, quick, radix, selection and heap sort, Graphs: Breadth first search and connected components. Depth first search in directed and undirected graphs. Disjkra’s algorithm, directed acyclic graphs and topological sort. Some geometric data-structures.",
            "prereqs_parsed": [
                [
                    "COL100"
                ]
            ],
            "type": "Core"
        },
        {
            "code": "ELL203",
            "name": "Electromechanics",
            "prereqs": "[ELL101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "Review: AC Circuits, Complex representation and Power Measurement. Magnetic Circuits: Simple magnetic circuit, analogy between magnetic circuits and electrical circuits, linear and nonlinear magnetic circuits, hysteresis and eddy current losses, permanent magnet materials. Transformers: Single-phase and three-phase, analysis, equivalent circuit, Tests on transformers, phasor diagram regulation and efficiency, auto-transformer and instrument transformers (PT/CT). Electro-mechanical energy conversion principles: Force and EMF production in a rotating machine. DC machines: Types, construction, working principle, characteristics and applications. 3-phase induction machines: Types, construction, Introduction to windings and winding factor, production of revolving magnetic field, working principle on 3-phase induction machine, equivalent circuit, characteristics, phasor diagram and applications. 3-phase synchronous machines: Types, construction, working i  principle, equivalent circuit, characteristics, phasor diagram and applications. Fractional-HP and Special Machines.",
            "prereqs_parsed": [
                [
                    "ELL101"
                ]
            ],
            "type": "Core"
        },
        {
            "code": "ELL211",
            "name": "Physical Electronics",
            "prereqs": "[ELL101 and PYL101]",
            "overlap": "ELL732, ELL231, EPL336, EPL439 , PHL653,",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "PHL704, PHL705, PHL727, PHL793 Semiconductor materials , crystal structure, carriers in semiconductors, band structure, density of states, excitons, doping and carrier statistics, carrier transport, recombination and generation, p-n junction physics: built-in potential, forward and reverse bias, capacitance, diode currents, breakdown, tunnel effects; metal- semiconductor junctions; BJTs: current gain/Gummel plots, transistor models, breakdown;MoSFET physics: MoS capacitors, inversion, depletion, accumulation, flatband, threshold voltage, long-channel model, saturation, short-channel models, sub-threshold conduction, SPICE models for MoSFETs; optoelectronic device physics, LEDs/ oLEDs, lasers, photodetectors, solar cells.",
            "prereqs_parsed": [
                [
                    "ELL101",
                    "PYL101"
                ]
            ],
            "type": "Core"
        },
        {
            "code": "HUL211",
            "name": "Introduction to Economics",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "Current economic problems. Alternative economic systems. An overview of the economy. The market mechanism. National product and income. Consumption, savings and investment. Determination of national income. Aggregate demand and supply. Fiscal policy. The nature of money and monetary policy. Inflation and unemployment. Basic concepts of price theory. Determination of price by supply and demand. Elasticity of demand and supply. Theory of production. Theory of costs. Pricing in competitive and monopoly markets. The gains from international trade. Theory of exchange rates. Balance of payments. Economic growth, and development. Inequality and poverty.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL212",
            "name": "Microeconomics",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "Micro versus macroeconomics. Theory of consumer behavior and demand. Consumer preferences. Indifference curve. Consumer equilibrium. Demand function. Income and substitution effects. The Slutsky equation. Market demand. Elasticities. Average and marginal revenue. Revealed preference theory of firm. Production functions. Law of variable proportions. Laws of return to scale. Isoquants. Input substitution. Equilibrium of the firm. Expansion path. Cost function. Theory of costs. Short Run and Long run costs. Shape of LAC. Economies and diseconomies of scale. Market equilibrium under perfect competition. Equilibrium under alternative forms of market. Monopoly: pure and discriminating. Monopolistic competition. oligopoly.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL213",
            "name": "Macroeconomics",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "Major economic problems. National income accounting. Expenditure and income approaches to GNP. Measuring inflation and unemployment. Determination of the equilibrium level of income. Consumption function. Investment demand. Aggregate demand and equilibrium output. The multiplier process. Government sector. Fiscal policy. Tax receipts and Transfer payments. Foreign spending. Money, interest and income. Functions of money. Definition of money. Reserve Bank of India and Commercial Banks. Creation of money. The instruments of monetary control. The demand for money. Investment expenditure and rate of interest. The IS curve. Money market and the LM curve. Liquidity trap. The IS-LM model. Derivation of the aggregate demand curve. Monetary and fiscal polices. Keynesian versus monetarist views. The aggregate supply function: Keynesian and classical. Inflation and unemployment. Stagflation. The Phillips curve. The long-run Phillips curve. Inflation expectations. The rational expectations.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL217",
            "name": "History of Economic Thought",
            "prereqs": "[]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "This course will introduce ideas in the history of economic thought, from mercantilism, socialism, communism, capitalism to the rise of modern economic theory (e.g. utiliarianism), along with questions about economic theory (especially from behavioural sciences).",
            "prereqs_parsed": [],
            "type": "HUL2XX"
        },
        {
            "code": "HUL232",
            "name": "Modern Indian Fiction in Translation",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "Students would be introduced to the conditions, beginning in 19th century colonial rule in India, which led to the emergent Indian middle-class intelligentsia to experiment with European forms of literature but striving for an alternative expression. Indian languages became the medium through which writers sought to address issues of identity, tradition, modernity, gender, the rural and the urban, the private and the public. The course will study the various experiments in narration, language, characterization and style undertaken by authors to shape these themes.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL235",
            "name": "Rise of the Novel",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "The socio-politcal contexts which lead to the rise of the novel in Europe – the emergence of print, the expansion of literacy, and the establishment of capitalism. Close reading of selected texts accompanying concepts like the rise of the modern individual, varied narrative techniques and national consciousness. The emerging sub- genres of the novel – the comic, the picaresque, the historical novel and the realist novel. The linkage of the novel to the colonial project and its influence on world literature.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL236",
            "name": "Introduction to Drama",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "Brief history of the development and importance of drama in Western and Indian contexts. Readings from both ancient and contemporary drama theorists. Generic differences between different forms of drama such as tragedy, comedy, realist, ‘folk’, Absurd, etc. Detailed study of important examples of different forms of drama.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL237",
            "name": "Contemporary Fiction",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "- Approaches to contemporary fiction - Looking at contemporary styles - realism, modernism, postmodernism - Contemporary versions of classical genres - the diary, epistolary form, epic, etc. - the relationship of society with science and technology through fiction - the relationship between self and society through fiction -Race, nationality, culture and identity - contemporary forms.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL239",
            "name": "Indian Fiction in English",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "The course involves a detailed study of 3-4 texts corresponding to the distinct phases of literary activity in the genre: the early period of the 1940s and 50s in which writers like Mulk Raj Anand, Raja Rao and R.K. Narayan made their presence felt, before Salman Rushdie, and more quietly, Amitav Ghosh and Vikram Seth, erupted into the scene in the 1980s, spawning a generation of writers attaining international acclaim - Arundhati Roy, Aravind Adiga, Kiran Desai, and many others. Some of the questions that will be addressed are: Who constitutes the main audience for this writing, and (how) does the writing cater to it? How does one position the expatriate Indian writer both residing and publishing abroad? How does English become an Indian language? Is there a thematic congruence in the novels that fall under this category, and does it differ from the thematic concerns of novels written in other Indian languages? Students will be encouraged to read a novel in at least one other Indian language in order to allow them to pose these questions in a more pointed manner.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL240",
            "name": "Indian English Poetry",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "The aim of this course will be to read the poems of Indian English  Writers (pre and post-Independence), with specific reference to the articulation of their identity. Some of the perspectives from which the poems will be discussed include the notion of home (childhood, family and ancestors); land (history, geography, community, caste and contemporary politics); language (the dialogue between the different languages in the creative repertoire of the poets); and culture (ritual, traditions, legends and myths). The course will also look at the differences between the resident and expatriate poets vis-a-vis the conflicts and resolutions as expressed in their poems.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL242",
            "name": "Fundamentals of language sciences",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "This course provides answers to basic questions about the nature and constitution of human language in the mind/brain of native speakers. Varied aspects of linguistic organization, including structures of sounds, words and sentences are considered to understand the core universals of all languages as well as their variations. Cases of feral children, language deficiencies and cognition-language interactions are also highlighted.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL243",
            "name": "Language and Communication",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "This course offers a wide-ranging introduction to, and analysis of, varieties of spoken and written language. From political oratory to examination answer scripts to computer codes, not to mention jokes, riddles and poetry, human language offers an amazingly rich set of structures for expressing and conveying our thoughts, intentions and desires. The course will consider some of these linguistic structures and communicative strategies in detail, beginning with early childhood development. How is it that children in every culture learn language so effortlessly despite its great complexity? The course aims to introduce students to a set of theories that address this and other puzzles and mysteries in the arena of language studies. Finally, since a central focus of the course is communication, it will strive to be as interactive as possible, with lots of scope for the discussion and working out of actual ‘problems’ in language use.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL251",
            "name": "Introduction to Logic",
            "prereqs": "[]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "In this course, students are introduced to fundamentals of informal logic and verbal analysis, material and formal fallacies of reasoning often found in ordinary discourse, deductive and Inductive reasoning, validity and soundness, formal rules and principles of the deductive system of Aristotelian logic, traditional square of opposition; propositional calculus; first order predicate calculus; the modern square of opposition and the problem of existential import; identity and definite descriptions; methods for formulating natural language arguments in symbolic forms and techniques for checking their validity; various meta-logical theorems and their proofs.",
            "prereqs_parsed": [],
            "type": "HUL2XX"
        },
        {
            "code": "HUL253",
            "name": "Moral Literacy and Moral choices",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "This is primarily a course in applied ethics. It will focus primarily on questions like: What is the meaning of right action? Can ethical assertions be true or false? Is morality relative to society? or can we say that acts have universal moral content? The course discussions will help to demonstrate that morality is not always self-evident and that rational morality must come in place of taboo based moralities.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL256",
            "name": "Critical Thinking",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "What makes philosophical thinking radically critical? Investigation of the nature of knowledge about the world and justification of knowledge claims. Metaphysical understanding of the Absolute  and Mind-Body relation. The nature of ethical and aesthetic beliefs and attitudes as part of understanding the nature of values. The discussion of the above issues will be influenced by three philosophical orientational perspectives: Anglo-American Analytic, Continental Phenomenological and Classical Indian.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL258",
            "name": "Social and Political Philosophy",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "As closely aligned areas in philosophy– social philosophy with the role of individual in society and political philosophy with the role of government- this course bridges divides between social theory, political philosophy, and the history of social and political thought as also between empirical and normative analysis through perspectives from metaphysics, epistemology and axiology. A range of socio- political thinkers, theories and concepts will be taught. It will provide a broad survey of fundamental social and political questions in current contexts discussing philosophical issues central to political thought and radical critiques of current political theories.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL261",
            "name": "Introduction to Psychology",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "Psychological Science- Assumptions, schools, methods of doing psychology research, The relationship between brain, body and mental functioning, Sensation, perception and making sense of the world, Consciousness, Life span development and motor and language development, Nature and nurture controversy, The learning process and some important explanations of how we learn, Meaning of motivation and explanations, Theories of emotions and expression and regulation of emotions, Basic cognitive processes, Language development, why we remember and why we forget- some explanations, Different kinds of intelligence, explanations of creativity, Differences among individuals and explanations for personality differences, Application of psychology to everyday life- enhancing health and well-being, performance, social relations, and sensitivity to environmental, social and cultural contexts.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL265",
            "name": "Theories of Personality",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "Personality: Meaning & Assessment. Psychoanalytic & Neo- Psychoanalytic Approach ; Behavioural Approach; Cognitive Approach; Social- Cognitive Approach; Humanistic Approach; The Traits Approach; Models of healthy personality: the notion of the mature person, the self-actualizing personality etc. Personality disorders; Psychotherapeutic techniques and Yoga & Meditation; Indian perspective on personality; Personality in Socio- cultural context.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL267",
            "name": "Positive Psychology",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "Positive Psychology: A historical and contextual overview; Relationship between Indian Psychology and Positive Psychology; Correlates and predictors of life satisfaction and subjective well-being across various cultures; Latest researches on self-esteem, optimism, flow, post- traumatic growth, positive ageing, character strengths, etc.; Major  theories and models within positive psychology – Self-Determination theory, Broaden-and-Build theory, Authentic Happiness, Psychological Well-being, etc., Interpersonal character strengths & well- being; Specific Coping Approaches: meditation, yoga and spirituality; Future of the Field.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL271",
            "name": "Introduction to Sociology",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "Introduction to the discipline of sociology and its emergence as a science in the context of the development of modern industrial society in Europe. Introduction to key classical and contemporary theorists in Sociology.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL272",
            "name": "Introduction to Sociology of India",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "This course will begin with a discussion on the various constructions of Indian society from colonial to contemporary times. The structural and cultural dimensions of Indian society are explored at the level of village, city, region, nation and civilization. Sources of differentiation, diversity and unity are explored through institutions such as caste, class and tribe; kinship, family, marriage and gender systems, religious traditions and political organisations. Transformations in these institutions are analysed and fault lines explored by studying contemporary issues of secularism, communalism, religious conversions, caste and identity movements. The sociological perspective remains key to interpreting changes in Indian society in the era of globalization and rapid economic change.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL274",
            "name": "Re-thinking the Indian Tradition",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "The examination of sources, the structure, the texts and exemplars of the Indian tradition provide the theoretical framework for the discussion of contemporary political and social issues. These are economic development and social justice religion and the nation, communalism and secularism, caste class and gender equity and so on. The political misuse of tradition in programs of reform and revival both in the past and in modern times will be highlighted to underline the need for rethinking tradition in an academically serious manner.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL275",
            "name": "Environment, Development and Society",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "Students will be exposed to contemporary themes and debates on connection between environment, development, and society; industrialization and risk society; challenge of sustainable development; perception of the environment, dependence for livelihood, identity, and power on natural resources; social ecology; what is the role of religion in determining our world view and relation with the environment?; recognition of indigenous knowledge; rise of environmental movements, development projects and recent conflict over natural resources; understanding major environmental disasters and industrial accidents; global climate change negotiations; gender and environment.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL276",
            "name": "Sociology of Knowledge",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "The de-mystification of science as a privileged form of knowledge since Copernicus. Re-examining the laboratory, the factory and the nation-state, structures linked to the West-European model of science. Examining systems deemed ethno-science or folk-lore, to set up a dialogue with institutionalized science. Comparing science with religion as forms of knowledge having competing power over human belief and action. Examining Traditional Knowledge (TK) systems and their relevance for global economy.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL281",
            "name": "Technology and Governance",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "The course will begin with theories and concepts on the use of technologies to improve governance such as efficiency, transparency, empowerment, economic gains, decentralization etc. It will discuss the concepts of democracy and governance, corruption and accountability. Examples and case studies from topics such as information and communication technologies for development, electronic governance, electronic voting, electronic databases (uID), web portals, community radio etc. Public-private partnerships, regulation of technology by the state, surveillance, and the role of stakeholders in the policy making process.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL282",
            "name": "System and Structure: An Introduction to",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "Communication Theory This course is an introduction to theories of communication for which there is not sufficient time in the other communication courses, which are mainly applied in their orientation. This is an interdisciplinary course. It will examine how the notion of communication is used in different disciplines in the humanities and the social sciences. It will intersect with problems of organizational structure, linguistic structure, interpersonal structure and the problem of what is involved in changing a structure. This course will include no components of remedial English, business correspondence or skill building activities. only those really interested in theoretical questions should enroll.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL286",
            "name": "Social Science Approaches to Development",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "Distinction between ‘growth’ and ‘development’; historical genesis and evolution of the concept of development; theories of development and underdevelopment; the political nature of the development process. Role of state, market, culture and civil society in development. Gendered nature of development. Post-independence Indian experience (centralized planning and socialism) of development; selected comparisons with China, East Asia, South Asia, Africa, Latin America. Explaining India’s slow progress in human and social development, poor record in reduction of poverty and inequality. Impact of globalization, foreign aid and economic reform on India’s development. Experiments with decentralization and sustainable development.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL289",
            "name": "Science, Technology and Human Development",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "The course will begin by identifying various dimensions of human development and mapping the state of India and the world on these indicators. It will then discuss theories about how science and technology (S&T) have shaped human development historically and the dynamics of technological change. Relationship between innovation and human development will be discussed using examples from the appropriate technology movement, health, education, nutrition, energy, environment, and others. Gender dimensions of S&T, indigenous knowledge, and radical critiques of S&T will be discussed.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL290",
            "name": "Technology and Culture",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "To examine the relationship between technology and culture through a consideration of modern/current developments in various specific areas: e.g. Biotechnology and Medicine, IT, AI & Robotics, Fashion Technology, Magic Technology, Communications, Defense and Space Research. To focus on the roles played by the IITs themselves in creating ‘knowledge societies’ - that is, in influencing, formulating and envisioning the links between technological ‘solutions’ and socio-cultural ‘problems’ especially in the Indian context. Here we  will discuss, for example: Patent Laws, Gender Issues, Environmental Ethics, Design(er) and Person(al) Technological Aesthetics, Technologies for the Disabled, Educational Technologies.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "ELP101",
            "name": "Introduction to Electrical Engineering",
            "prereqs": "[]",
            "overlap": "",
            "credits": 0,
            "hours": {
                "lecture": 0,
                "tutorial": 0,
                "practical": 0
            },
            "description": "(Laboratory) 1 Credit (0-0-2) CRO (mechanism and usage). KCL, KVL, Network theorem verification. Step/transient response of RL, RC, RLC, circuits. Steady state response of Circuits of sinusoidal excitation. Diode experiment (clipping, clamping and rectification). Basic circuits using opamp. Transformers oC and SC tests. BH loop in an iron core, DC and AC motor – for observation only. A small mini-project.",
            "prereqs_parsed": [],
            "type": "Core"
        },
        {
            "code": "PYP100",
            "name": "Physics Laboratory",
            "prereqs": "[]",
            "overlap": "",
            "credits": 2.0,
            "hours": {
                "lecture": 0,
                "tutorial": 0,
                "practical": 4
            },
            "description": "Experiments based on Design and Study of Power sources, Charging and discharging of a capacitor, Electromagnetic Induction, Phase Measurement. Experiments on geometrical and wave optics including interference, diffraction, dispersion and polarization. Experiments based on mechanics, heat, sound, fluids, resonance, like linear air track, coupled pendulum and oscillators, thermal conductivity, elasticity. Experiments in the area of modern physics, like Planck’s constant, lasers, semiconductor band gap, wave motion, mechanical transmission lines.",
            "prereqs_parsed": [],
            "type": "Core"
        },
        {
            "code": "MCP101",
            "name": "Product Realization through Manufacturing",
            "prereqs": "[]",
            "overlap": "",
            "credits": 2.0,
            "hours": {
                "lecture": 0,
                "tutorial": 0,
                "practical": 4
            },
            "description": "Exposing role of manufacturing processes in product realization; understanding product realization by endeavouring hands on activities; Experience of product realization by undertaking manufacturing exercises and assembly activity in teams.",
            "prereqs_parsed": [],
            "type": "Core"
        }
    ],
    "4": [
        {
            "code": "MTL106",
            "name": "Probability and Stochastic Processes",
            "prereqs": "[]",
            "overlap": "MTL108",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "Axioms of probability, Probability space, Conditional probability, Independence, Bayes’ rule, Random variable, Some common discrete and continuous distributions, Distribution of Functions of Random Variable, Moments, Generating functions, Two and higher dimensional distributions, Functions of random variables, order statistics, Conditional distributions, Covariance, Correlation coefficient, conditional expectation, Modes of convergences, Laws of large numbers, Central limit theorem, Definition of Stochastic process, Classification and properties of stochastic processes, Simple Markovian stochastic processes, Gaussian processes, Stationary processes, Discrete and continuous time Markov chains, Classification of states, Limiting distribution, Birth and death process, Poisson process, Steady state and transient distributions, Simple Markovian queuing models (M/M/1, M/M/1/N, M/M/c/N, M/M/N/N, M/M/∞).",
            "prereqs_parsed": [],
            "type": "Core"
        },
        {
            "code": "ELL225",
            "name": "Control Engineering",
            "prereqs": "[ELL205]",
            "overlap": "MCL212, CLL261",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "Introduction to the control problem, Control System Components: Sensors, Actuators, Computational blocks. Mathematical representation of systems, state variable model, linearization, transfer function model. Transfer function and state variable models of suitable mechanical, electrical, thermal and pneumatic systems. Closed loop systems, Block diagram and signal flow analysis, Basic Characteristics of feedback control systems: stability, steady-state accuracy, transient accuracy, disturbance rejection, sensitivity analysis and robustness. Basic modes of feedback control: Proportional, Integral, Derivative. Concept of stability, Stability criteria: Routh stability criterion, Mikhailov’s criterion, Kharitonov theorem. Time response of 2nd order system, steady state error analysis. Performance specifications in the  time domain. Root locus method of design. Nyquist stability criterion. Frequency response analysis: Nyquist plots, Bode plots, Nichols Charts, Performance specifications in frequency domain, Frequency domain methods of design. Lead lag compensation.",
            "prereqs_parsed": [
                [
                    "ELL205"
                ]
            ],
            "type": "Core"
        },
        {
            "code": "ELL201",
            "name": "Digital Electronics",
            "prereqs": "[ELL101]",
            "overlap": "",
            "credits": 4.5,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 3
            },
            "description": "Gates, binary number systems, arithmetic operations. Minimization using K-maps, reduced K-maps, tabular methods; design using multiplexers, decoders, and ROMs. Latches, flip-flops, registers and counters. Asynchronous, synchronous counters. Finite state machines, implementations thereof. Mealy, Moore machines. Clock period computation. Memories. Partitioning and pipelining. VHDL/Verilog, the register-transfer-level description style. Switch level introduction to logic families, CMoS logic, static, pre-charge and clocked logic. Asynchronous circuits and design styles.",
            "prereqs_parsed": [
                [
                    "ELL101"
                ]
            ],
            "type": "Core"
        },
        {
            "code": "ELL212",
            "name": "Electromagnetics",
            "prereqs": "[PYL101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "Review of Maxwell’s equations, wave propagations in unbounded medium. Boundary conditions, reflection and refraction of plane waves. Evanescent waves and surface plasmons. Waveguides: parallel-plane guide, TE, TM and TEM waves, rectangular and cylindrical waveguides, resonators. Dielectric guides and optical fibres. Transmission Lines: distributed parameter circuits, traveling and standing waves, impedance matching, Smith chart, analogy with plane waves. Planar transmission lines: stripline, micro stripline. Radiation: retarded potentials, Hertzian dipole, short loop, antenna parameters. Numerical techniques in electromagnetics.",
            "prereqs_parsed": [
                [
                    "PYL101"
                ]
            ],
            "type": "Core"
        },
        {
            "code": "ELP203",
            "name": "Electromechanics Laboratory",
            "prereqs": "[ELL101]",
            "overlap": "",
            "credits": 1.5,
            "hours": {
                "lecture": 0,
                "tutorial": 0,
                "practical": 3
            },
            "description": "",
            "prereqs_parsed": [
                [
                    "ELL101"
                ]
            ],
            "type": "Core"
        },
        {
            "code": "SBL100",
            "name": "Introductory Biology for Engineers",
            "prereqs": "[]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 2
            },
            "description": "Darwinian evolution & molecular perspective; Introduction to phylogeny - Classification systems in biology and relationships; Cellular assemblies – From single cell to multi-cellular organisms: Geometry, Structure and Energetics; Comparing natural vs. humanmade machines; Infection, disease and evolution – synergy and antagonism; Immunology – An example of permutations and combinations in biology; Cancer biology – Control and regulation; Stem cells – Degeneracy in biological systems; Engineering designs inspired by biology – Micro- to Macro- scales. Laboratory: Biosafety; Buffers in biology - Measuring microlitres, Preparation of standard biological buffers, buffering capacity and pKa of buffers, response of cells and plant tissues in different buffering conditions; observing cell surface and intracellular contents using light and fluorescence microscopy, measuring cellular motion using real-time video microscopy; Measuring and visualizing intracellular molecular components - Proteins and Genomic DNA",
            "prereqs_parsed": [],
            "type": "Core"
        },
        {
            "code": "ELP101",
            "name": "Introduction to Electrical Engineering",
            "prereqs": "[]",
            "overlap": "",
            "credits": 0,
            "hours": {
                "lecture": 0,
                "tutorial": 0,
                "practical": 0
            },
            "description": "(Laboratory) 1 Credit (0-0-2) CRO (mechanism and usage). KCL, KVL, Network theorem verification. Step/transient response of RL, RC, RLC, circuits. Steady state response of Circuits of sinusoidal excitation. Diode experiment (clipping, clamping and rectification). Basic circuits using opamp. Transformers oC and SC tests. BH loop in an iron core, DC and AC motor – for observation only. A small mini-project.",
            "prereqs_parsed": [],
            "type": "Core"
        },
        {
            "code": "PYP100",
            "name": "Physics Laboratory",
            "prereqs": "[]",
            "overlap": "",
            "credits": 2.0,
            "hours": {
                "lecture": 0,
                "tutorial": 0,
                "practical": 4
            },
            "description": "Experiments based on Design and Study of Power sources, Charging and discharging of a capacitor, Electromagnetic Induction, Phase Measurement. Experiments on geometrical and wave optics including interference, diffraction, dispersion and polarization. Experiments based on mechanics, heat, sound, fluids, resonance, like linear air track, coupled pendulum and oscillators, thermal conductivity, elasticity. Experiments in the area of modern physics, like Planck’s constant, lasers, semiconductor band gap, wave motion, mechanical transmission lines.",
            "prereqs_parsed": [],
            "type": "Core"
        },
        {
            "code": "MCP101",
            "name": "Product Realization through Manufacturing",
            "prereqs": "[]",
            "overlap": "",
            "credits": 2.0,
            "hours": {
                "lecture": 0,
                "tutorial": 0,
                "practical": 4
            },
            "description": "Exposing role of manufacturing processes in product realization; understanding product realization by endeavouring hands on activities; Experience of product realization by undertaking manufacturing exercises and assembly activity in teams.",
            "prereqs_parsed": [],
            "type": "Core"
        }
    ],
    "5": [
        {
            "code": "CVL100",
            "name": "Environmental Science",
            "prereqs": "[]",
            "overlap": "",
            "credits": 2.0,
            "hours": {
                "lecture": 2,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Pollutant sources and control in air and water, solid waste management, noise pollution and control, cleaner production and life cycle analysis, reuse, recovery, source reduction and raw material substitution, basics of environmental impact assessment, environmental risk assessment and environmental audit, emerging technologies for sustainable environmental management, identification and evaluation of emerging environmental issues with air, water, wastewater and solid wastes.",
            "prereqs_parsed": [],
            "type": "Core"
        },
        {
            "code": "ELL302",
            "name": "Power Electronics",
            "prereqs": "[ELL231 or ELL211]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Introduction to Power Electronics devices and protection: Thyristor family devices, principle of operation, IGBT operation, principles and ratings. Snubber designs, selection and protection, Firing circuits. AC-DC converters: uncontrolled, semi-controlled, fully controlled and dual converters in single-phase and three-phase configurations, design, phase control, harmonic analysis, firing circuits and their designs. Improved power quality AC-DC converters. Choppers: Introduction to dc-dc conversion, various topologies, buck, boost, buck-boost converters, High frequency isolated dc-dc converters: design problems, PWM control and operation. Inverters: Basics of dc to ac conversion, inverter circuit configurations and principle of operation, VSI and CSI, single and three-phase configurations, Square wave and sinusoidal PWM control methods and harmonic control. Design problems. AC voltage controllers: Introduction to ac to ac conversion, single- phase and three-phase ac voltage controller circuit configurations, applications, advantages, harmonic analysis, control, design problems. Cyclo-converters: single-phase to single-phase, three-phase to single- phase, three-phase to three-phase and single-phase to three-phase circuit configurations thyristors and triacs.",
            "prereqs_parsed": [
                [
                    "ELL231",
                    "ELL211"
                ]
            ],
            "type": "Core"
        },
        {
            "code": "ELL311",
            "name": "Communication Engineering",
            "prereqs": "[ELL205]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "Review of Fourier Series and Transforms. Hilbert Transforms, BandpassSignal and System Representation. Random Processes, Stationarity, Power Spectral Density, Gaussian Process, Noise. Amplitude Modulation, DSBSC, SSB, VSB: Signal Representation, Generation and Demodulation. Frequency Modulation: Signal Representation, Generation and Demodulation. Mixing, Superheterodyne Receiver, Phase Recovery with PLLs. Noise: in AM Receivers using Coherent Detection, in AM Receivers using Envelope Detection, in FM Receivers. Sampling, Pulse-Amplitude Modulation. Quantization, Pulse-Code Modulation. Noise considerations in PCM, Time Division Multiplexing, Delta Modulation. Intersymbol Interference, Introduction to Information Theory: concepts of Entropy and Source-Coding",
            "prereqs_parsed": [
                [
                    "ELL205"
                ]
            ],
            "type": "Core"
        },
        {
            "code": "ELL305",
            "name": "Computer Architecture",
            "prereqs": "[ELL201]",
            "overlap": "CSL211",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Introduction: Performance measurement, Instruction Set Architecture, Computer Arithmetic, Processor: ALu design, Control design, Pipelining, Memory Hierarchy, I/o management, Multicores, Multiprocessors, Clusters, GPu.",
            "prereqs_parsed": [
                [
                    "ELL201"
                ]
            ],
            "type": "Core"
        },
        {
            "code": "ELP225",
            "name": "Control Engineering Laboratory",
            "prereqs": "[ELL225]",
            "overlap": "",
            "credits": 1.5,
            "hours": {
                "lecture": 0,
                "tutorial": 0,
                "practical": 3
            },
            "description": "Basics of Sensors and Actuators, Study of AC and DC Motors, Linear Systems, Analog and Digital Motors, Synchros, Temperature Control.",
            "prereqs_parsed": [
                [
                    "ELL225"
                ]
            ],
            "type": "Core"
        },
        {
            "code": "ELL304",
            "name": "Analog Electronics",
            "prereqs": "[ELL101 and ELL202 and (ELL211 or ELL231)]",
            "overlap": "",
            "credits": 5.5,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 3
            },
            "description": "Review of working of BJT and MoSFET, large signal and small signal models, biasing schemes, analysis and design of various single stage amplifier configuration, low and high frequency analysis of single stage amplifiers, frequency compensation, current mirrors, multistage amplifiers; differential and operational amplifiers, negative and positive feedback, oscillators and power amplifiers.",
            "prereqs_parsed": [
                [
                    "ELL101",
                    "ELL202",
                    "ELL211"
                ],
                [
                    "ELL101",
                    "ELL202",
                    "ELL231"
                ]
            ],
            "type": "Core"
        },
        {
            "code": "ELP212",
            "name": "Electromagnetics Laboratory",
            "prereqs": "[ELL212]",
            "overlap": "",
            "credits": 1.5,
            "hours": {
                "lecture": 0,
                "tutorial": 0,
                "practical": 3
            },
            "description": "",
            "prereqs_parsed": [
                [
                    "ELL212"
                ]
            ],
            "type": "Core"
        },
        {
            "code": "ELP101",
            "name": "Introduction to Electrical Engineering",
            "prereqs": "[]",
            "overlap": "",
            "credits": 0,
            "hours": {
                "lecture": 0,
                "tutorial": 0,
                "practical": 0
            },
            "description": "(Laboratory) 1 Credit (0-0-2) CRO (mechanism and usage). KCL, KVL, Network theorem verification. Step/transient response of RL, RC, RLC, circuits. Steady state response of Circuits of sinusoidal excitation. Diode experiment (clipping, clamping and rectification). Basic circuits using opamp. Transformers oC and SC tests. BH loop in an iron core, DC and AC motor – for observation only. A small mini-project.",
            "prereqs_parsed": [],
            "type": "Core"
        },
        {
            "code": "PYP100",
            "name": "Physics Laboratory",
            "prereqs": "[]",
            "overlap": "",
            "credits": 2.0,
            "hours": {
                "lecture": 0,
                "tutorial": 0,
                "practical": 4
            },
            "description": "Experiments based on Design and Study of Power sources, Charging and discharging of a capacitor, Electromagnetic Induction, Phase Measurement. Experiments on geometrical and wave optics including interference, diffraction, dispersion and polarization. Experiments based on mechanics, heat, sound, fluids, resonance, like linear air track, coupled pendulum and oscillators, thermal conductivity, elasticity. Experiments in the area of modern physics, like Planck’s constant, lasers, semiconductor band gap, wave motion, mechanical transmission lines.",
            "prereqs_parsed": [],
            "type": "Core"
        },
        {
            "code": "MCP101",
            "name": "Product Realization through Manufacturing",
            "prereqs": "[]",
            "overlap": "",
            "credits": 2.0,
            "hours": {
                "lecture": 0,
                "tutorial": 0,
                "practical": 4
            },
            "description": "Exposing role of manufacturing processes in product realization; understanding product realization by endeavouring hands on activities; Experience of product realization by undertaking manufacturing exercises and assembly activity in teams.",
            "prereqs_parsed": [],
            "type": "Core"
        }
    ],
    "6": [
        {
            "code": "ELL301",
            "name": "Electrical and Electronics Instrumentation",
            "prereqs": "[ELL101]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Basics of Measurement and Instrumentation, Instrument Examples: Galvanometer, Accelerometer etc; calibration methods, Voltage and Current Measurements; Theory, calibration, application, Errors and compensation. Power and Energy Measurement and its errors, Methods of correction, LPF wattmeter, Phantom loading, Induction type KWH meter; Calibration of wattmeter, energy meter. Potentiometer and Instrument Transformer :DC and AC potentiometer, C.T. and V.T. construction, theory, operation, characteristics. Digital Instrumentation.",
            "prereqs_parsed": [
                [
                    "ELL101"
                ]
            ],
            "type": "DE"
        },
        {
            "code": "ELL312",
            "name": "Semiconductor Process Technology",
            "prereqs": "[ELL211]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Semiconductor materials (inorganic and organic), history of semiconductor IC devices, crystal structure, defects, vacancies and  interstitials, semiconductor crystal growth, bulk doping methods, purification methods, wafer manufacture, diffusion, surface doping, oxidation, dopant redistribution, ion implantation and annealing, rapid thermal processes, photolithography, masks, photoresists, exposure, e-beam lithography, vacuum systems, gas flow, plasma processes, pumping theory, leaks, vacuum gauges, wet etching, plasma etching, process gas chemistry and polymerization, ion milling, reactive ion etching, lift-off, vapor pressure of materials, evaporation, sputtering, deposition rate and step coverage, codepositions, film growth mechanisms and stress, chemical vapor deposition, metal-organic chemical vapor deposition, atomic layer deposition, molecular beam epitaxy, planarization processes, interconnects, yield and device integration.",
            "prereqs_parsed": [
                [
                    "ELL211"
                ]
            ],
            "type": "DE"
        },
        {
            "code": "ELL313",
            "name": "Antennas and Propagation",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Prerequisites: ELL212 Starting from the principle of radiation different types of antenna; wire, slot, planar and their arrays with feeds. Antenna synthesis and design and measurements. Characteristics of propagation of radio waves in different atmospheric layers and study of the losses, fading and scattering of microwave and millimeter waves in the atmosphere.",
            "prereqs_parsed": [],
            "type": "DE"
        },
        {
            "code": "ELL315",
            "name": "Introduction to Analog Integrated Circuits",
            "prereqs": "[ELL204 and ELL202]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Review of basic amplifiers. Current Mirrors, Reference Current and Voltage Sources. CMOS Operational Amplifier: Structure, Analysis and Design, Frequency Response and Compensation Techniques. Switched Capacitor Circuits: Principles of operation, Filter and non filter applications. Sample and Hold Circuits, Comparators. ADC: Characterization, Types of ADC and their relative merits and demerits, Design issues. DAC: Characterization, Types of DAC and their relative merits and demerits, Design issues.",
            "prereqs_parsed": [
                [
                    "ELL204",
                    "ELL202"
                ]
            ],
            "type": "DE"
        },
        {
            "code": "ELL316",
            "name": "Introduction to VLSI Design",
            "prereqs": "[ELL211]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Basic MoS characteristics; Deep sub-micron; velocity saturation; Dynamic MoS characteristics; parasitics; leakage; sizing; propagation delay; Logical effort, path delay, optimization; Ratio-ed logic, Pass transistor logic and parasitics; Dynamic logic, pulsed sequential logic; Logical synthesis, physical design, layout; Introduction to design of VLSI memories.",
            "prereqs_parsed": [
                [
                    "ELL211"
                ]
            ],
            "type": "DE"
        },
        {
            "code": "ELL318",
            "name": "Digital Hardware Design",
            "prereqs": "[ELL305]",
            "overlap": "CSL316",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Technology basics and digital logic families such as static CMoS, pass transistor, transmission gate, dynamic and domino logic. Advanced sequential logic elements with latch-based design and timing and clocking concepts. Design flows and paradigms. Data path, control and advanced pipeline implementations. Advanced digital arithmetic. Performance evaluation.",
            "prereqs_parsed": [
                [
                    "ELL305"
                ]
            ],
            "type": "DE"
        },
        {
            "code": "ELL319",
            "name": "Digital Signal Processing",
            "prereqs": "[ELL205]",
            "overlap": "ELL720",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 2
            },
            "description": "Review of Signals and Systems, Sampling and data reconstruction processes. Z transforms. Discrete linear systems. Frequency domain design of digital filters. Quantization effects in digital filters. Discrete Fourier transform and FFT algorithms. High speed convolution and its application to digital filtering.",
            "prereqs_parsed": [
                [
                    "ELL205"
                ]
            ],
            "type": "DE"
        },
        {
            "code": "ELL332",
            "name": "Electric Drives",
            "prereqs": "[ELL203]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Basic Concepts: Characteristics and operating modes of drive motors. Starting, braking and speed control of motors. 4 quadrant drives. Types of loads. Torque and associated controls used in process industries. DC Motor Drives: Characteristics, Starting Methods, Braking Methods, Speed Control using Converters and Choppers. Three phase Induction Motor Drives: Characteristics and Equivalent Circuits, Starting Methods, Braking Methods, Speed Control of Cage Rotor Induction Machines using as AC voltage controllers, Voltage- Source and Current-Source Inverters. V-by-F Control and other Control Techniques. Speed Control of Wound-Rotor Induction Machines using Rotor Resistance Variation; Slip-Power Recovery Scheme. Three phase Synchronous Motor Drives: Characteristics and Equivalent Circuits, Starting Methods, Braking Methods, Speed Control in True Synchronous and Self Control Modes. Special Machines: Permanent Magnet Brush-Less Motor Drives, Permanent Magnet Synchronous Motor Drives, Stepper and Reluctance Motor Drives.",
            "prereqs_parsed": [
                [
                    "ELL203"
                ]
            ],
            "type": "DE"
        },
        {
            "code": "ELL333",
            "name": "Multivariable Control",
            "prereqs": "[ELL225]",
            "overlap": "ELL721",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Review of control system fundamentals and basic linear algebra. Introduction to linear dynamical systems and properties. State-space representation and canonical realizations. Relation between state- space and transfer function representations. Similarity transformation. Diagonalization. Jordan canonical form. Matrix exponential and its properties. Solution of state equations. Cayley-Hamilton Theorem, Stability: BIBo and internal. Linearization of nonlinear systems. Controllability and observability. Minimal realization. State feedback and observer design. Linear Quadratic Regulator.",
            "prereqs_parsed": [
                [
                    "ELL225"
                ]
            ],
            "type": "DE"
        },
        {
            "code": "ELL365",
            "name": "Embedded Systems",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "overview of Embedded Systems; Embedded System Architecture: processor example ARM, PIC, etc.; features of digital signal processor; SoC, memory sub system, busstructure (PC 104, I2C, SPI etc.), interfacing protocols (uSB, IrDA etc), testing and debugging, power management; Embedded System Software: Program optimization,Concurrent Programming, Real time Scheduling and I/o management; Networked Embedded Systems: special networking protocols (CAN, Bluetooth); Applications.",
            "prereqs_parsed": [],
            "type": "DE"
        },
        {
            "code": "ELL400",
            "name": "Power Systems Protection",
            "prereqs": "[ELL303]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Fundamentals of Power system protection, philosophy of protective relays, Different types of relays, Introduction to protection elements like CT, PT, CB, Isolator etc, (includes CT and PT class, CB transients, CB rating and testing, Arc extinction in CB), over current relays: Principle, operation and setting, Directional relays : needs and operating principle, Power system components protected using over current relays, Differential relays: Principle, operation and setting, Protection of three phase transformer, bus bar and generator using differential relays, Distance relays : Principle, operation and setting, Simple impedance relay, reactance relay, Mho relay and angle impedance relays, Quadrilateral relays, Transmission line protection using distance relays, Static relays: principle, amplitude comparator and phase comparator, Phase comparator realization using positive coincidence period, Distance relay realization using comparators, Generator protection, overview of Numerical relaying and few algorithms, Phasor extraction, Introduction to PMu and its use, Fault location.",
            "prereqs_parsed": [
                [
                    "ELL303"
                ]
            ],
            "type": "DE"
        },
        {
            "code": "ELL401",
            "name": "Advanced Electromechanics",
            "prereqs": "[ELL203]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Introduction to Advancement in Electromechanics, Permanent Magnet Brushless DC Machines, Permanent Magnet Synchronous Motors, Switched Reluctance Motors, Single-Phase Machines, Axial Field Machines and other Advanced Electrical Machines, Introduction to Control of Advanced Electrical Machines, Applications in Industry, Domestic Appliances, Electric Mobility, etc., Computer Aided Simulation and Design of Advanced Electrical Machines, Case Studies.",
            "prereqs_parsed": [
                [
                    "ELL203"
                ]
            ],
            "type": "DE"
        },
        {
            "code": "ELL402",
            "name": "Computer Communication",
            "prereqs": "[MEL250]",
            "overlap": "ELL785, COL334",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "(i) Introduction, network structure: Basic networking concepts, Motivations for layered network concepts, Network examples; (ii) oSI reference model: Layering concepts, overview of different layer functionalities; (iii) TCP/IP: Layering concepts, Layered functionalities, packet formats, fragmentation, Different layer protocols and examples: ARP, ICMP, etc., Congestion and error control; (iv) Network examples and functionalities: Ethernet, hub, bridge, switch, WANs, MANs, LANs, PANs, BANs; (v) Basic network protocol analysis: Performance metrics, Queueing models; (vi) Multiaccess protocols: Need for multiaccess protocols, Contention-free access schemes, Contention-based protocols: ALoHA, CSMA; (vii) Routing in data networks: Basic graph theoretic concepts, spanning tree, Shortest path routing, distance vector routing, link state routing, RIP, oSPF; (viii) Cross-layer protocol optimization concepts: Distributed control, cost and energy efficiencies.",
            "prereqs_parsed": [
                [
                    "MEL250"
                ]
            ],
            "type": "DE"
        },
        {
            "code": "ELL405",
            "name": "Operating Systems",
            "prereqs": "[ELL305]",
            "overlap": "COL331, MTL458, ELL783",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Introduction to oS; Process and Thread management; Scheduling; Concurrent threads  and  processes: mutual exclusion, synchronization, inter-process communication; Memory management: Cache and Virtual  Memory management; Resource management: deadlock and its prevention; File management; I/o management; Introduction to real time systems; Elements distributed operating systems.",
            "prereqs_parsed": [
                [
                    "ELL305"
                ]
            ],
            "type": "DE"
        },
        {
            "code": "ELL406",
            "name": "Robotics and Automation",
            "prereqs": "[ELL225]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Introduction to robotics. Basic components of robotic systems. Coordinate Transformation, D-H parameters. Forward and inverse kinematics. Velocity kinematics and Jacobian, Singularity analysis, Robot Dynamics : Holonomic and Non-Holonomic Systems. Trajectory planning. Robot control: linear and nonlinear. Actuators and Sensors. Vision based Robotic Control. Mobile Robots : Modeling and Control.",
            "prereqs_parsed": [
                [
                    "ELL225"
                ]
            ],
            "type": "DE"
        },
        {
            "code": "ELL409",
            "name": "Machine Intelligence and Learning",
            "prereqs": "[MTL106 and COL106]",
            "overlap": "ELL784, ELL789, COL341/COL774",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 2
            },
            "description": "Introduction to machine intelligence and intelligent agents; problem solving; knowledge representation and reasoning (logical and probabilistic); need for learning; basics of machine learning; Decision Trees; Rule-based models; linear learning models; Support Vector Machines; Artificial Neural Networks; Deep Learning; Probabilistic Modelling; Naive Bayes; Reinforcement Learning; Clustering; Feature Selection; Principal Component Analysis; Combining models; Philosophical issues in intelligence and learning. Substantive implementation assignments or a term project involving design of an intelligent learning-based system.",
            "prereqs_parsed": [
                [
                    "MTL106",
                    "COL106"
                ]
            ],
            "type": "DE"
        },
        {
            "code": "ELL410",
            "name": "Multicore Systems",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Motivation for muticores; Multithreading; Flynn’s taxonomy; Stream processing (vectVLIW, GPu). Message passing; Shared memory; Cache coherence in multiprocessor Synchronisation; Interconnection networks; Benchmarks and advanced topics; Project.",
            "prereqs_parsed": [],
            "type": "DE"
        },
        {
            "code": "ELL411",
            "name": "Digital Communications",
            "prereqs": "[ELL311]",
            "overlap": "ELL712",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 2
            },
            "description": "Matched Filter, Error Rate due to Noise. Intersymbol Interference, Nyquist’s Criterion, Duobinary Signaling. optimum Linear Receiver, Geometric Representation of Signals. Coherent Detection of Signals in Noise, Probability of Error. Coherent Digital Modulation Schemes: MPSK, MFSK, MQAM; Error Analysis. Noncoherent FSK, Differential PSK. Comparison of Digital Modulation Schemes, Bandwidth Efficiency. Pseudo-Noise Sequences and Spread Spectrum, Trellis coded modulation, Digital signaling over fading multipath channels, oFDM communications systems.",
            "prereqs_parsed": [
                [
                    "ELL311"
                ]
            ],
            "type": "DE"
        },
        {
            "code": "ELL703",
            "name": "Optimal Control Theory",
            "prereqs": "[ELL700 or ELL333]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Maximization of functionals of a single and several functions using calculus of variations, Constrained extremals, Euler-Lagrange Equation, Necessary conditions for optimal control, Pontryagin’s minimum principle and state inequality constraints, Minimum time problems, Minimum control effort problems, Linear quadratic regulator problems, Riccati Equation, Singular intervals in optimal control problems, The principle of optimality, Application of the principle of optimality to decision making, Dynamic programming applied to routing problems,  Solving optimal control problems using dynamic programming, Discrete linear regulator problem, Hamilton -Jacobi -Bellman Equation, Numerical Techniques to determine optimal trajectories.",
            "prereqs_parsed": [
                [
                    "ELL700",
                    "ELL333"
                ]
            ],
            "type": "DE"
        },
        {
            "code": "ELL710",
            "name": "Coding Theory",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Measure of information, Source coding, Communication channel models, Channel Capacity and coding, Linear Block codes, Low Density Parity Check (LDPC) Codes, Bounds on minimum distance, Cyclic codes, BCH codes, Reed Solomon Codes, Convolutional codes, Trellis coded Modulation, Viterbi decoding, Turbo codes, Introduction to Space-Time Codes and Introduction to Cryptography. If time permits, LDPC/Turbo codes in the wireless standards. There are no laboratory or design activities involved with this course.",
            "prereqs_parsed": [],
            "type": "DE"
        },
        {
            "code": "ELL715",
            "name": "Digital Image Processing",
            "prereqs": "[]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 2
            },
            "description": "Introduction to 2-D Signals and Systems. Image Digitization. Image Transforms. Image Enhancement: Image Restoration: Inverse Filtering, Algebraic Approach to Restoration, Wiener (LMS) approach, Constrained Least Squares Restoration, Adaptive methods for restoration. Image Reconstruction: The Filtered Back- Projection Algorithm, Algebraic Reconstruction Method. Image Segmentation: Detection of Discontinuities, Edge Linking and Boundary Detection, Thresholding, Region-oriented Segmentation. object representation and description: Boundary descriptors, region descriptors, HoG and SIFT based features. Colour Image processing: colour models, colour transformations, and processing techniques.",
            "prereqs_parsed": [],
            "type": "DE"
        },
        {
            "code": "ELL716",
            "name": "Telecommunication Switching and Transmission",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Wireline access circuits, long haul circuits, signaling, switching exchanges, analysis of telecom switching networks, teletraffic engineering, management protocols, multi-service telecom protocols and networks.",
            "prereqs_parsed": [],
            "type": "DE"
        },
        {
            "code": "ELL724",
            "name": "Multichannel Signal Processing",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Wave Propagation: Wave equation, plane and spherical wave solution in Cartesian co-ordinate system, wave solution in spherical co-ordinate system, Introduction of Spherical Harmonics. Mathematical Preliminaries of ASP: Linear Algebra Basics, Array Signal Processing Basics, optimization Algorithms. Acoustic Source Localization: Data model, correlation and subspace based (MuSIC, root-MuSIC) localization, wideband and narrowband source localization. Source activity detection, Localization and Tracking. Brain Source Localization for BCI Control: Introduction of Head harmonics for brain source localization (BSL), Application of BSL in BCI control, and physiological shape description for medical application. Source Estimation: Fixed beamforming, Null steering, adaptive beamforming, Beampattern Design: Robust/non-robust, Frequency invariant, least square, Joint optimization. Multichannel Signal Enhancement: Time and frequency domain-based enhancement, Joint Diagonalization, Noise rejection, Binary Masking and beamforming. More Application: Source separation, Dereverberation",
            "prereqs_parsed": [],
            "type": "DE"
        },
        {
            "code": "ELL725",
            "name": "Wireless Communications",
            "prereqs": "[ELL712]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "The wireless channel (physical modeling, linear time-varying system, discrete-time baseband model, time and frequency coherence), point- to-point communication (detection, diversity, spatial multiplexing), cellular systems (multiple access and interference management), capacity of point-to-point wireless channels (single and multi- antenna), capacity of single-antenna multiuser channels, point- to-point multi-antenna (MIMo) channels and spatial multiplexing, point-to-point MIMo capacity and multiplexing architectures.",
            "prereqs_parsed": [
                [
                    "ELL712"
                ]
            ],
            "type": "DE"
        },
        {
            "code": "ELL730",
            "name": "I.C. Technology",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Course Introduction, Modern Semiconductor IC fabrication Industrial/ Academic Landscape; Overview of modern CMOS process flow – basic steps; Crystal growth and wafer basics; Cleanroom basics – environment, infrastructure, advanced MoS cleaning, getering etc. Lithography; oxidation; Diffusion; Ion-Implantation; Thin-Film Deposition; Etching; Backend processes; Process Simulation- tools, techniques and methods; Advanced device fabrication concepts – I (SoI, FDSoI, etc); Advanced device fabrication concepts – II (organic, PV, hetero); Advanced device fabrication concepts – III (CNTs, Self-assembly etc).",
            "prereqs_parsed": [],
            "type": "DE"
        },
        {
            "code": "ELL738",
            "name": "Micro and Nano Photonics",
            "prereqs": "[PYL101]",
            "overlap": "PYL795",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Ray optics; Wave optics: Plane Waves, Spherical Waves, Interference, Diffraction; Paraxial Waves; Beam optics; Fabry Perot Cavity; Microresonators - Ring Resonators, Disc Resonators; Review of Electromagnetic (EM) Theory; Boundary Conditions; and some relevant EM problems; FDTD and FEM modeling; Fundamentals of Plasmonics - Surface Plasmon Resonance, Dispersion relation, Plasmon coupling conditions, Plasmonic gratings, Models describing the refractive index of metals; Localized Surface Plasmon Resonance; Plasmonic Sensors and Devices; Surface-enhanced Raman Scattering; Plasmonic waveguides and Interconnects; Photonic Crystals and Devices.",
            "prereqs_parsed": [
                [
                    "PYL101"
                ]
            ],
            "type": "DE"
        },
        {
            "code": "ELL740",
            "name": "Compact Modeling of Semiconductor Devices",
            "prereqs": "[(MoS or Microelectronics) and any]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "or Physical Electronics or VLSI technology Introduction to AMS enablement and PDK elements, Basics of semiconductor devices, Device modeling tools-TCAD and SPICE, Diode modeling, Resistor modeling, FEoL capacitor modeling, Advanced CMoS Technology, MoS transistor modeling, modeling of process variations, Mismatch and corners.",
            "prereqs_parsed": [],
            "type": "DE"
        },
        {
            "code": "ELL758",
            "name": "Power Quality",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Overview and definition of power quality (PQ), Sources of pollution, International power quality standards, and regulations. Power quality monitoring. Power quality problems. Loads which causes power quality problems. Power factor correction, zero voltage regulation, reactive power compensation, load balancing using load compensation techniques: passive shunt and series compensation, DSTATCoM (Distribution Static Compensators), DVR (Dynamic Voltage Restorers), uPQC (universal Power Quality Conditioners). Harmonic effects- within the power system, interference with communication Harmonic measurements. Harmonic elimination-using active (shunt, series and hybrid) and passive (shunt and series) filters. Improved power quality converters: single ac-dc converters, bridgeless isolated converter, bridgeless non-isolated converters, multi-pulse converters, multilevel converters, line commutated converters, power quality improvement in SMPS, uPS, drives, welding systems, lighting systems, and renewable energy systems.",
            "prereqs_parsed": [],
            "type": "DE"
        },
        {
            "code": "ELL765",
            "name": "Smart Grid Technology",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Introduction:- Smart Grid an overview; Components of Smart Grid; Intelligent Appliances; Smart Substations; Smart Distributions- Generations; Smart Power meters; universal Access (wind, solar, hydro etc.) Smart Grid Technologies:  Integrated Communications; Sensing and Measurement; Advance Control Methods; Advance components and Improved Interfaces and Decision Support. Benefits of Smart Grid: Self-Healing; Power Quality Improvement; utilization of all generation and storage options; optimized use of assets and efficient Operation. Miscellaneous: Smart Grid Challenges; Smart Grid Projects; Contribution of Microgrid in development of Smart Grid.",
            "prereqs_parsed": [],
            "type": "DE"
        },
        {
            "code": "ELS310",
            "name": "Independent Study (EE1)",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 0,
                "tutorial": 3,
                "practical": 0
            },
            "description": "",
            "prereqs_parsed": [],
            "type": "DE"
        },
        {
            "code": "PYL102",
            "name": "Principles of Electronic Materials",
            "prereqs": "[PYL101]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "(Program Linked Course: Not available to B.Tech. (Engineering Physics) students) Energy bands in solids(KP model), Classification of electronic materials: metals, semiconductors and insulators. Free electron model, Conductivity in metals and Concepts of Fermi level, effective mass and holes, Concept of phonons, Thermoelectricity, Intrinsic, extrinsic and degenerate semiconductors, Fermi level variation by carrier concentration and temperature, Metal-semiconductor junction, p-n junction, Diffusion and drift transport, carrier life time and diffusion length; Direct and indirect band gaps, optical transitions, photon absorption, Exciton, photovoltaic effect, Dielectrics and electrical polarization, Depolarization field, Clausius- Mossotti relation; Drude model, Electronic polarization and its mechanisms, Dielectric breakdown; Piezoelectricity, Pyroelectricity and Ferroelectricity; Magnetism in materials – types of interactions, Magnetic susceptibility, Curie and Neel temperatures; Domains, Magnetic anisotropies, Spin-orbit interaction.",
            "prereqs_parsed": [
                [
                    "PYL101"
                ]
            ],
            "type": "Core"
        },
        {
            "code": "MCL142",
            "name": "Thermal Science for Electrical Engineers",
            "prereqs": "[]",
            "overlap": "MCL140, MCL141, CLL121",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Introduction to applications. Basic concepts and definitions – system, boundary, equilibrium, steady state and others. Thermodynamic properties of a pure substance – saturated and other states. Work and heat – definition and applications. 1st Law – internal energy and enthalpy, applications to non-flow/closed and flow/open systems (SSSF and uSuF). 2nd Law – corollaries, Clausius inequality, entropy. Carnot cycle. Basics of gas-vapor mixtures. Vapor power cycles – Rankine cycle and its modifications. Steam generation and its use – power plants, co-generation, combined cycles. Introduction to various equipment in thermal power plant. Introduction to transport phenomena: various modes of transport of momentum and energy - diffusion and advective transport. Modes of heat transfer in various applications. Conduction: Heat diffusion equation, 1-D steady state conduction in extended surfaces, infinite and semi-infinite walls, heat generation, lumped capacitance. Convection: Forced and free convection - mass, momentum and energy conservation equations, non-dimensional numbers, hydrodynamic and thermal boundary layers, basics of heat transfer in external and internal laminar and turbulent flows, and use of co- relations. Radiation: properties, Laws, 3-surface network for diffuse- gray surfaces. Familiarization with heat exchangers. Application area example: cooling of electronics.",
            "prereqs_parsed": [],
            "type": "Core"
        },
        {
            "code": "ELL303",
            "name": "Power Engineering-I",
            "prereqs": "[ELL101 and ELL203]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "Introduction to the basic structure of power system along with various power generation technologies. Modeling of generators, transformers  and transmission line for power system analysis. per unit system. Power flow analysis. Fault analysis in power systems. Power system stability studies. Transients in power system and travelling waves. Introduction to power system relaying and brief idea of over current, differentia and impedance based protection. Basic concepts of Power system operation and control. Introduction to HVDC and FACTS.",
            "prereqs_parsed": [
                [
                    "ELL101",
                    "ELL203"
                ]
            ],
            "type": "Core"
        },
        {
            "code": "ELP311",
            "name": "Communication Engineering Laboratory",
            "prereqs": "[ELL311]",
            "overlap": "",
            "credits": 0,
            "hours": {
                "lecture": 0,
                "tutorial": 0,
                "practical": 0
            },
            "description": "1 Credit (0-0-2) Laboratory experiments on analog, pulse, and basic digital modulation and demodulation techniques.",
            "prereqs_parsed": [
                [
                    "ELL311"
                ]
            ],
            "type": "Core"
        },
        {
            "code": "HUL211",
            "name": "Introduction to Economics",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "Current economic problems. Alternative economic systems. An overview of the economy. The market mechanism. National product and income. Consumption, savings and investment. Determination of national income. Aggregate demand and supply. Fiscal policy. The nature of money and monetary policy. Inflation and unemployment. Basic concepts of price theory. Determination of price by supply and demand. Elasticity of demand and supply. Theory of production. Theory of costs. Pricing in competitive and monopoly markets. The gains from international trade. Theory of exchange rates. Balance of payments. Economic growth, and development. Inequality and poverty.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL212",
            "name": "Microeconomics",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "Micro versus macroeconomics. Theory of consumer behavior and demand. Consumer preferences. Indifference curve. Consumer equilibrium. Demand function. Income and substitution effects. The Slutsky equation. Market demand. Elasticities. Average and marginal revenue. Revealed preference theory of firm. Production functions. Law of variable proportions. Laws of return to scale. Isoquants. Input substitution. Equilibrium of the firm. Expansion path. Cost function. Theory of costs. Short Run and Long run costs. Shape of LAC. Economies and diseconomies of scale. Market equilibrium under perfect competition. Equilibrium under alternative forms of market. Monopoly: pure and discriminating. Monopolistic competition. oligopoly.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL213",
            "name": "Macroeconomics",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "Major economic problems. National income accounting. Expenditure and income approaches to GNP. Measuring inflation and unemployment. Determination of the equilibrium level of income. Consumption function. Investment demand. Aggregate demand and equilibrium output. The multiplier process. Government sector. Fiscal policy. Tax receipts and Transfer payments. Foreign spending. Money, interest and income. Functions of money. Definition of money. Reserve Bank of India and Commercial Banks. Creation of money. The instruments of monetary control. The demand for money. Investment expenditure and rate of interest. The IS curve. Money market and the LM curve. Liquidity trap. The IS-LM model. Derivation of the aggregate demand curve. Monetary and fiscal polices. Keynesian versus monetarist views. The aggregate supply function: Keynesian and classical. Inflation and unemployment. Stagflation. The Phillips curve. The long-run Phillips curve. Inflation expectations. The rational expectations.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL217",
            "name": "History of Economic Thought",
            "prereqs": "[]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "This course will introduce ideas in the history of economic thought, from mercantilism, socialism, communism, capitalism to the rise of modern economic theory (e.g. utiliarianism), along with questions about economic theory (especially from behavioural sciences).",
            "prereqs_parsed": [],
            "type": "HUL2XX"
        },
        {
            "code": "HUL232",
            "name": "Modern Indian Fiction in Translation",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "Students would be introduced to the conditions, beginning in 19th century colonial rule in India, which led to the emergent Indian middle-class intelligentsia to experiment with European forms of literature but striving for an alternative expression. Indian languages became the medium through which writers sought to address issues of identity, tradition, modernity, gender, the rural and the urban, the private and the public. The course will study the various experiments in narration, language, characterization and style undertaken by authors to shape these themes.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL235",
            "name": "Rise of the Novel",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "The socio-politcal contexts which lead to the rise of the novel in Europe – the emergence of print, the expansion of literacy, and the establishment of capitalism. Close reading of selected texts accompanying concepts like the rise of the modern individual, varied narrative techniques and national consciousness. The emerging sub- genres of the novel – the comic, the picaresque, the historical novel and the realist novel. The linkage of the novel to the colonial project and its influence on world literature.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL236",
            "name": "Introduction to Drama",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "Brief history of the development and importance of drama in Western and Indian contexts. Readings from both ancient and contemporary drama theorists. Generic differences between different forms of drama such as tragedy, comedy, realist, ‘folk’, Absurd, etc. Detailed study of important examples of different forms of drama.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL237",
            "name": "Contemporary Fiction",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "- Approaches to contemporary fiction - Looking at contemporary styles - realism, modernism, postmodernism - Contemporary versions of classical genres - the diary, epistolary form, epic, etc. - the relationship of society with science and technology through fiction - the relationship between self and society through fiction -Race, nationality, culture and identity - contemporary forms.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL239",
            "name": "Indian Fiction in English",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "The course involves a detailed study of 3-4 texts corresponding to the distinct phases of literary activity in the genre: the early period of the 1940s and 50s in which writers like Mulk Raj Anand, Raja Rao and R.K. Narayan made their presence felt, before Salman Rushdie, and more quietly, Amitav Ghosh and Vikram Seth, erupted into the scene in the 1980s, spawning a generation of writers attaining international acclaim - Arundhati Roy, Aravind Adiga, Kiran Desai, and many others. Some of the questions that will be addressed are: Who constitutes the main audience for this writing, and (how) does the writing cater to it? How does one position the expatriate Indian writer both residing and publishing abroad? How does English become an Indian language? Is there a thematic congruence in the novels that fall under this category, and does it differ from the thematic concerns of novels written in other Indian languages? Students will be encouraged to read a novel in at least one other Indian language in order to allow them to pose these questions in a more pointed manner.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL240",
            "name": "Indian English Poetry",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "The aim of this course will be to read the poems of Indian English  Writers (pre and post-Independence), with specific reference to the articulation of their identity. Some of the perspectives from which the poems will be discussed include the notion of home (childhood, family and ancestors); land (history, geography, community, caste and contemporary politics); language (the dialogue between the different languages in the creative repertoire of the poets); and culture (ritual, traditions, legends and myths). The course will also look at the differences between the resident and expatriate poets vis-a-vis the conflicts and resolutions as expressed in their poems.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL242",
            "name": "Fundamentals of language sciences",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "This course provides answers to basic questions about the nature and constitution of human language in the mind/brain of native speakers. Varied aspects of linguistic organization, including structures of sounds, words and sentences are considered to understand the core universals of all languages as well as their variations. Cases of feral children, language deficiencies and cognition-language interactions are also highlighted.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL243",
            "name": "Language and Communication",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "This course offers a wide-ranging introduction to, and analysis of, varieties of spoken and written language. From political oratory to examination answer scripts to computer codes, not to mention jokes, riddles and poetry, human language offers an amazingly rich set of structures for expressing and conveying our thoughts, intentions and desires. The course will consider some of these linguistic structures and communicative strategies in detail, beginning with early childhood development. How is it that children in every culture learn language so effortlessly despite its great complexity? The course aims to introduce students to a set of theories that address this and other puzzles and mysteries in the arena of language studies. Finally, since a central focus of the course is communication, it will strive to be as interactive as possible, with lots of scope for the discussion and working out of actual ‘problems’ in language use.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL251",
            "name": "Introduction to Logic",
            "prereqs": "[]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "In this course, students are introduced to fundamentals of informal logic and verbal analysis, material and formal fallacies of reasoning often found in ordinary discourse, deductive and Inductive reasoning, validity and soundness, formal rules and principles of the deductive system of Aristotelian logic, traditional square of opposition; propositional calculus; first order predicate calculus; the modern square of opposition and the problem of existential import; identity and definite descriptions; methods for formulating natural language arguments in symbolic forms and techniques for checking their validity; various meta-logical theorems and their proofs.",
            "prereqs_parsed": [],
            "type": "HUL2XX"
        },
        {
            "code": "HUL253",
            "name": "Moral Literacy and Moral choices",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "This is primarily a course in applied ethics. It will focus primarily on questions like: What is the meaning of right action? Can ethical assertions be true or false? Is morality relative to society? or can we say that acts have universal moral content? The course discussions will help to demonstrate that morality is not always self-evident and that rational morality must come in place of taboo based moralities.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL256",
            "name": "Critical Thinking",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "What makes philosophical thinking radically critical? Investigation of the nature of knowledge about the world and justification of knowledge claims. Metaphysical understanding of the Absolute  and Mind-Body relation. The nature of ethical and aesthetic beliefs and attitudes as part of understanding the nature of values. The discussion of the above issues will be influenced by three philosophical orientational perspectives: Anglo-American Analytic, Continental Phenomenological and Classical Indian.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL258",
            "name": "Social and Political Philosophy",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "As closely aligned areas in philosophy– social philosophy with the role of individual in society and political philosophy with the role of government- this course bridges divides between social theory, political philosophy, and the history of social and political thought as also between empirical and normative analysis through perspectives from metaphysics, epistemology and axiology. A range of socio- political thinkers, theories and concepts will be taught. It will provide a broad survey of fundamental social and political questions in current contexts discussing philosophical issues central to political thought and radical critiques of current political theories.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL261",
            "name": "Introduction to Psychology",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "Psychological Science- Assumptions, schools, methods of doing psychology research, The relationship between brain, body and mental functioning, Sensation, perception and making sense of the world, Consciousness, Life span development and motor and language development, Nature and nurture controversy, The learning process and some important explanations of how we learn, Meaning of motivation and explanations, Theories of emotions and expression and regulation of emotions, Basic cognitive processes, Language development, why we remember and why we forget- some explanations, Different kinds of intelligence, explanations of creativity, Differences among individuals and explanations for personality differences, Application of psychology to everyday life- enhancing health and well-being, performance, social relations, and sensitivity to environmental, social and cultural contexts.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL265",
            "name": "Theories of Personality",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "Personality: Meaning & Assessment. Psychoanalytic & Neo- Psychoanalytic Approach ; Behavioural Approach; Cognitive Approach; Social- Cognitive Approach; Humanistic Approach; The Traits Approach; Models of healthy personality: the notion of the mature person, the self-actualizing personality etc. Personality disorders; Psychotherapeutic techniques and Yoga & Meditation; Indian perspective on personality; Personality in Socio- cultural context.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL267",
            "name": "Positive Psychology",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "Positive Psychology: A historical and contextual overview; Relationship between Indian Psychology and Positive Psychology; Correlates and predictors of life satisfaction and subjective well-being across various cultures; Latest researches on self-esteem, optimism, flow, post- traumatic growth, positive ageing, character strengths, etc.; Major  theories and models within positive psychology – Self-Determination theory, Broaden-and-Build theory, Authentic Happiness, Psychological Well-being, etc., Interpersonal character strengths & well- being; Specific Coping Approaches: meditation, yoga and spirituality; Future of the Field.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL271",
            "name": "Introduction to Sociology",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "Introduction to the discipline of sociology and its emergence as a science in the context of the development of modern industrial society in Europe. Introduction to key classical and contemporary theorists in Sociology.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL272",
            "name": "Introduction to Sociology of India",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "This course will begin with a discussion on the various constructions of Indian society from colonial to contemporary times. The structural and cultural dimensions of Indian society are explored at the level of village, city, region, nation and civilization. Sources of differentiation, diversity and unity are explored through institutions such as caste, class and tribe; kinship, family, marriage and gender systems, religious traditions and political organisations. Transformations in these institutions are analysed and fault lines explored by studying contemporary issues of secularism, communalism, religious conversions, caste and identity movements. The sociological perspective remains key to interpreting changes in Indian society in the era of globalization and rapid economic change.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL274",
            "name": "Re-thinking the Indian Tradition",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "The examination of sources, the structure, the texts and exemplars of the Indian tradition provide the theoretical framework for the discussion of contemporary political and social issues. These are economic development and social justice religion and the nation, communalism and secularism, caste class and gender equity and so on. The political misuse of tradition in programs of reform and revival both in the past and in modern times will be highlighted to underline the need for rethinking tradition in an academically serious manner.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL275",
            "name": "Environment, Development and Society",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "Students will be exposed to contemporary themes and debates on connection between environment, development, and society; industrialization and risk society; challenge of sustainable development; perception of the environment, dependence for livelihood, identity, and power on natural resources; social ecology; what is the role of religion in determining our world view and relation with the environment?; recognition of indigenous knowledge; rise of environmental movements, development projects and recent conflict over natural resources; understanding major environmental disasters and industrial accidents; global climate change negotiations; gender and environment.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL276",
            "name": "Sociology of Knowledge",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "The de-mystification of science as a privileged form of knowledge since Copernicus. Re-examining the laboratory, the factory and the nation-state, structures linked to the West-European model of science. Examining systems deemed ethno-science or folk-lore, to set up a dialogue with institutionalized science. Comparing science with religion as forms of knowledge having competing power over human belief and action. Examining Traditional Knowledge (TK) systems and their relevance for global economy.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL281",
            "name": "Technology and Governance",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "The course will begin with theories and concepts on the use of technologies to improve governance such as efficiency, transparency, empowerment, economic gains, decentralization etc. It will discuss the concepts of democracy and governance, corruption and accountability. Examples and case studies from topics such as information and communication technologies for development, electronic governance, electronic voting, electronic databases (uID), web portals, community radio etc. Public-private partnerships, regulation of technology by the state, surveillance, and the role of stakeholders in the policy making process.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL282",
            "name": "System and Structure: An Introduction to",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "Communication Theory This course is an introduction to theories of communication for which there is not sufficient time in the other communication courses, which are mainly applied in their orientation. This is an interdisciplinary course. It will examine how the notion of communication is used in different disciplines in the humanities and the social sciences. It will intersect with problems of organizational structure, linguistic structure, interpersonal structure and the problem of what is involved in changing a structure. This course will include no components of remedial English, business correspondence or skill building activities. only those really interested in theoretical questions should enroll.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL286",
            "name": "Social Science Approaches to Development",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "Distinction between ‘growth’ and ‘development’; historical genesis and evolution of the concept of development; theories of development and underdevelopment; the political nature of the development process. Role of state, market, culture and civil society in development. Gendered nature of development. Post-independence Indian experience (centralized planning and socialism) of development; selected comparisons with China, East Asia, South Asia, Africa, Latin America. Explaining India’s slow progress in human and social development, poor record in reduction of poverty and inequality. Impact of globalization, foreign aid and economic reform on India’s development. Experiments with decentralization and sustainable development.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL289",
            "name": "Science, Technology and Human Development",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "The course will begin by identifying various dimensions of human development and mapping the state of India and the world on these indicators. It will then discuss theories about how science and technology (S&T) have shaped human development historically and the dynamics of technological change. Relationship between innovation and human development will be discussed using examples from the appropriate technology movement, health, education, nutrition, energy, environment, and others. Gender dimensions of S&T, indigenous knowledge, and radical critiques of S&T will be discussed.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL290",
            "name": "Technology and Culture",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "To examine the relationship between technology and culture through a consideration of modern/current developments in various specific areas: e.g. Biotechnology and Medicine, IT, AI & Robotics, Fashion Technology, Magic Technology, Communications, Defense and Space Research. To focus on the roles played by the IITs themselves in creating ‘knowledge societies’ - that is, in influencing, formulating and envisioning the links between technological ‘solutions’ and socio-cultural ‘problems’ especially in the Indian context. Here we  will discuss, for example: Patent Laws, Gender Issues, Environmental Ethics, Design(er) and Person(al) Technological Aesthetics, Technologies for the Disabled, Educational Technologies.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "ELP302",
            "name": "Power Electronics Laboratory",
            "prereqs": "[ELL302]",
            "overlap": "",
            "credits": 1.5,
            "hours": {
                "lecture": 0,
                "tutorial": 0,
                "practical": 3
            },
            "description": "",
            "prereqs_parsed": [
                [
                    "ELL302"
                ]
            ],
            "type": "Core"
        },
        {
            "code": "ELP305",
            "name": "Design and System Laboratory",
            "prereqs": "[]",
            "overlap": "",
            "credits": 1.5,
            "hours": {
                "lecture": 0,
                "tutorial": 0,
                "practical": 3
            },
            "description": "",
            "prereqs_parsed": [],
            "type": "Core"
        },
        {
            "code": "ELP101",
            "name": "Introduction to Electrical Engineering",
            "prereqs": "[]",
            "overlap": "",
            "credits": 0,
            "hours": {
                "lecture": 0,
                "tutorial": 0,
                "practical": 0
            },
            "description": "(Laboratory) 1 Credit (0-0-2) CRO (mechanism and usage). KCL, KVL, Network theorem verification. Step/transient response of RL, RC, RLC, circuits. Steady state response of Circuits of sinusoidal excitation. Diode experiment (clipping, clamping and rectification). Basic circuits using opamp. Transformers oC and SC tests. BH loop in an iron core, DC and AC motor – for observation only. A small mini-project.",
            "prereqs_parsed": [],
            "type": "Core"
        },
        {
            "code": "PYP100",
            "name": "Physics Laboratory",
            "prereqs": "[]",
            "overlap": "",
            "credits": 2.0,
            "hours": {
                "lecture": 0,
                "tutorial": 0,
                "practical": 4
            },
            "description": "Experiments based on Design and Study of Power sources, Charging and discharging of a capacitor, Electromagnetic Induction, Phase Measurement. Experiments on geometrical and wave optics including interference, diffraction, dispersion and polarization. Experiments based on mechanics, heat, sound, fluids, resonance, like linear air track, coupled pendulum and oscillators, thermal conductivity, elasticity. Experiments in the area of modern physics, like Planck’s constant, lasers, semiconductor band gap, wave motion, mechanical transmission lines.",
            "prereqs_parsed": [],
            "type": "Core"
        },
        {
            "code": "MCP101",
            "name": "Product Realization through Manufacturing",
            "prereqs": "[]",
            "overlap": "",
            "credits": 2.0,
            "hours": {
                "lecture": 0,
                "tutorial": 0,
                "practical": 4
            },
            "description": "Exposing role of manufacturing processes in product realization; understanding product realization by endeavouring hands on activities; Experience of product realization by undertaking manufacturing exercises and assembly activity in teams.",
            "prereqs_parsed": [],
            "type": "Core"
        }
    ],
    "7": [
        {
            "code": "ELD411",
            "name": "B.Tech. Project-I",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 0,
                "tutorial": 0,
                "practical": 6
            },
            "description": "",
            "prereqs_parsed": [],
            "type": "Core"
        },
        {
            "code": "ELL301",
            "name": "Electrical and Electronics Instrumentation",
            "prereqs": "[ELL101]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Basics of Measurement and Instrumentation, Instrument Examples: Galvanometer, Accelerometer etc; calibration methods, Voltage and Current Measurements; Theory, calibration, application, Errors and compensation. Power and Energy Measurement and its errors, Methods of correction, LPF wattmeter, Phantom loading, Induction type KWH meter; Calibration of wattmeter, energy meter. Potentiometer and Instrument Transformer :DC and AC potentiometer, C.T. and V.T. construction, theory, operation, characteristics. Digital Instrumentation.",
            "prereqs_parsed": [
                [
                    "ELL101"
                ]
            ],
            "type": "DE"
        },
        {
            "code": "ELL312",
            "name": "Semiconductor Process Technology",
            "prereqs": "[ELL211]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Semiconductor materials (inorganic and organic), history of semiconductor IC devices, crystal structure, defects, vacancies and  interstitials, semiconductor crystal growth, bulk doping methods, purification methods, wafer manufacture, diffusion, surface doping, oxidation, dopant redistribution, ion implantation and annealing, rapid thermal processes, photolithography, masks, photoresists, exposure, e-beam lithography, vacuum systems, gas flow, plasma processes, pumping theory, leaks, vacuum gauges, wet etching, plasma etching, process gas chemistry and polymerization, ion milling, reactive ion etching, lift-off, vapor pressure of materials, evaporation, sputtering, deposition rate and step coverage, codepositions, film growth mechanisms and stress, chemical vapor deposition, metal-organic chemical vapor deposition, atomic layer deposition, molecular beam epitaxy, planarization processes, interconnects, yield and device integration.",
            "prereqs_parsed": [
                [
                    "ELL211"
                ]
            ],
            "type": "DE"
        },
        {
            "code": "ELL313",
            "name": "Antennas and Propagation",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Prerequisites: ELL212 Starting from the principle of radiation different types of antenna; wire, slot, planar and their arrays with feeds. Antenna synthesis and design and measurements. Characteristics of propagation of radio waves in different atmospheric layers and study of the losses, fading and scattering of microwave and millimeter waves in the atmosphere.",
            "prereqs_parsed": [],
            "type": "DE"
        },
        {
            "code": "ELL315",
            "name": "Introduction to Analog Integrated Circuits",
            "prereqs": "[ELL204 and ELL202]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Review of basic amplifiers. Current Mirrors, Reference Current and Voltage Sources. CMOS Operational Amplifier: Structure, Analysis and Design, Frequency Response and Compensation Techniques. Switched Capacitor Circuits: Principles of operation, Filter and non filter applications. Sample and Hold Circuits, Comparators. ADC: Characterization, Types of ADC and their relative merits and demerits, Design issues. DAC: Characterization, Types of DAC and their relative merits and demerits, Design issues.",
            "prereqs_parsed": [
                [
                    "ELL204",
                    "ELL202"
                ]
            ],
            "type": "DE"
        },
        {
            "code": "ELL316",
            "name": "Introduction to VLSI Design",
            "prereqs": "[ELL211]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Basic MoS characteristics; Deep sub-micron; velocity saturation; Dynamic MoS characteristics; parasitics; leakage; sizing; propagation delay; Logical effort, path delay, optimization; Ratio-ed logic, Pass transistor logic and parasitics; Dynamic logic, pulsed sequential logic; Logical synthesis, physical design, layout; Introduction to design of VLSI memories.",
            "prereqs_parsed": [
                [
                    "ELL211"
                ]
            ],
            "type": "DE"
        },
        {
            "code": "ELL318",
            "name": "Digital Hardware Design",
            "prereqs": "[ELL305]",
            "overlap": "CSL316",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Technology basics and digital logic families such as static CMoS, pass transistor, transmission gate, dynamic and domino logic. Advanced sequential logic elements with latch-based design and timing and clocking concepts. Design flows and paradigms. Data path, control and advanced pipeline implementations. Advanced digital arithmetic. Performance evaluation.",
            "prereqs_parsed": [
                [
                    "ELL305"
                ]
            ],
            "type": "DE"
        },
        {
            "code": "ELL319",
            "name": "Digital Signal Processing",
            "prereqs": "[ELL205]",
            "overlap": "ELL720",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 2
            },
            "description": "Review of Signals and Systems, Sampling and data reconstruction processes. Z transforms. Discrete linear systems. Frequency domain design of digital filters. Quantization effects in digital filters. Discrete Fourier transform and FFT algorithms. High speed convolution and its application to digital filtering.",
            "prereqs_parsed": [
                [
                    "ELL205"
                ]
            ],
            "type": "DE"
        },
        {
            "code": "ELL332",
            "name": "Electric Drives",
            "prereqs": "[ELL203]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Basic Concepts: Characteristics and operating modes of drive motors. Starting, braking and speed control of motors. 4 quadrant drives. Types of loads. Torque and associated controls used in process industries. DC Motor Drives: Characteristics, Starting Methods, Braking Methods, Speed Control using Converters and Choppers. Three phase Induction Motor Drives: Characteristics and Equivalent Circuits, Starting Methods, Braking Methods, Speed Control of Cage Rotor Induction Machines using as AC voltage controllers, Voltage- Source and Current-Source Inverters. V-by-F Control and other Control Techniques. Speed Control of Wound-Rotor Induction Machines using Rotor Resistance Variation; Slip-Power Recovery Scheme. Three phase Synchronous Motor Drives: Characteristics and Equivalent Circuits, Starting Methods, Braking Methods, Speed Control in True Synchronous and Self Control Modes. Special Machines: Permanent Magnet Brush-Less Motor Drives, Permanent Magnet Synchronous Motor Drives, Stepper and Reluctance Motor Drives.",
            "prereqs_parsed": [
                [
                    "ELL203"
                ]
            ],
            "type": "DE"
        },
        {
            "code": "ELL333",
            "name": "Multivariable Control",
            "prereqs": "[ELL225]",
            "overlap": "ELL721",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Review of control system fundamentals and basic linear algebra. Introduction to linear dynamical systems and properties. State-space representation and canonical realizations. Relation between state- space and transfer function representations. Similarity transformation. Diagonalization. Jordan canonical form. Matrix exponential and its properties. Solution of state equations. Cayley-Hamilton Theorem, Stability: BIBo and internal. Linearization of nonlinear systems. Controllability and observability. Minimal realization. State feedback and observer design. Linear Quadratic Regulator.",
            "prereqs_parsed": [
                [
                    "ELL225"
                ]
            ],
            "type": "DE"
        },
        {
            "code": "ELL365",
            "name": "Embedded Systems",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "overview of Embedded Systems; Embedded System Architecture: processor example ARM, PIC, etc.; features of digital signal processor; SoC, memory sub system, busstructure (PC 104, I2C, SPI etc.), interfacing protocols (uSB, IrDA etc), testing and debugging, power management; Embedded System Software: Program optimization,Concurrent Programming, Real time Scheduling and I/o management; Networked Embedded Systems: special networking protocols (CAN, Bluetooth); Applications.",
            "prereqs_parsed": [],
            "type": "DE"
        },
        {
            "code": "ELL400",
            "name": "Power Systems Protection",
            "prereqs": "[ELL303]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Fundamentals of Power system protection, philosophy of protective relays, Different types of relays, Introduction to protection elements like CT, PT, CB, Isolator etc, (includes CT and PT class, CB transients, CB rating and testing, Arc extinction in CB), over current relays: Principle, operation and setting, Directional relays : needs and operating principle, Power system components protected using over current relays, Differential relays: Principle, operation and setting, Protection of three phase transformer, bus bar and generator using differential relays, Distance relays : Principle, operation and setting, Simple impedance relay, reactance relay, Mho relay and angle impedance relays, Quadrilateral relays, Transmission line protection using distance relays, Static relays: principle, amplitude comparator and phase comparator, Phase comparator realization using positive coincidence period, Distance relay realization using comparators, Generator protection, overview of Numerical relaying and few algorithms, Phasor extraction, Introduction to PMu and its use, Fault location.",
            "prereqs_parsed": [
                [
                    "ELL303"
                ]
            ],
            "type": "DE"
        },
        {
            "code": "ELL401",
            "name": "Advanced Electromechanics",
            "prereqs": "[ELL203]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Introduction to Advancement in Electromechanics, Permanent Magnet Brushless DC Machines, Permanent Magnet Synchronous Motors, Switched Reluctance Motors, Single-Phase Machines, Axial Field Machines and other Advanced Electrical Machines, Introduction to Control of Advanced Electrical Machines, Applications in Industry, Domestic Appliances, Electric Mobility, etc., Computer Aided Simulation and Design of Advanced Electrical Machines, Case Studies.",
            "prereqs_parsed": [
                [
                    "ELL203"
                ]
            ],
            "type": "DE"
        },
        {
            "code": "ELL402",
            "name": "Computer Communication",
            "prereqs": "[MEL250]",
            "overlap": "ELL785, COL334",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "(i) Introduction, network structure: Basic networking concepts, Motivations for layered network concepts, Network examples; (ii) oSI reference model: Layering concepts, overview of different layer functionalities; (iii) TCP/IP: Layering concepts, Layered functionalities, packet formats, fragmentation, Different layer protocols and examples: ARP, ICMP, etc., Congestion and error control; (iv) Network examples and functionalities: Ethernet, hub, bridge, switch, WANs, MANs, LANs, PANs, BANs; (v) Basic network protocol analysis: Performance metrics, Queueing models; (vi) Multiaccess protocols: Need for multiaccess protocols, Contention-free access schemes, Contention-based protocols: ALoHA, CSMA; (vii) Routing in data networks: Basic graph theoretic concepts, spanning tree, Shortest path routing, distance vector routing, link state routing, RIP, oSPF; (viii) Cross-layer protocol optimization concepts: Distributed control, cost and energy efficiencies.",
            "prereqs_parsed": [
                [
                    "MEL250"
                ]
            ],
            "type": "DE"
        },
        {
            "code": "ELL405",
            "name": "Operating Systems",
            "prereqs": "[ELL305]",
            "overlap": "COL331, MTL458, ELL783",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Introduction to oS; Process and Thread management; Scheduling; Concurrent threads  and  processes: mutual exclusion, synchronization, inter-process communication; Memory management: Cache and Virtual  Memory management; Resource management: deadlock and its prevention; File management; I/o management; Introduction to real time systems; Elements distributed operating systems.",
            "prereqs_parsed": [
                [
                    "ELL305"
                ]
            ],
            "type": "DE"
        },
        {
            "code": "ELL406",
            "name": "Robotics and Automation",
            "prereqs": "[ELL225]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Introduction to robotics. Basic components of robotic systems. Coordinate Transformation, D-H parameters. Forward and inverse kinematics. Velocity kinematics and Jacobian, Singularity analysis, Robot Dynamics : Holonomic and Non-Holonomic Systems. Trajectory planning. Robot control: linear and nonlinear. Actuators and Sensors. Vision based Robotic Control. Mobile Robots : Modeling and Control.",
            "prereqs_parsed": [
                [
                    "ELL225"
                ]
            ],
            "type": "DE"
        },
        {
            "code": "ELL409",
            "name": "Machine Intelligence and Learning",
            "prereqs": "[MTL106 and COL106]",
            "overlap": "ELL784, ELL789, COL341/COL774",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 2
            },
            "description": "Introduction to machine intelligence and intelligent agents; problem solving; knowledge representation and reasoning (logical and probabilistic); need for learning; basics of machine learning; Decision Trees; Rule-based models; linear learning models; Support Vector Machines; Artificial Neural Networks; Deep Learning; Probabilistic Modelling; Naive Bayes; Reinforcement Learning; Clustering; Feature Selection; Principal Component Analysis; Combining models; Philosophical issues in intelligence and learning. Substantive implementation assignments or a term project involving design of an intelligent learning-based system.",
            "prereqs_parsed": [
                [
                    "MTL106",
                    "COL106"
                ]
            ],
            "type": "DE"
        },
        {
            "code": "ELL410",
            "name": "Multicore Systems",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Motivation for muticores; Multithreading; Flynn’s taxonomy; Stream processing (vectVLIW, GPu). Message passing; Shared memory; Cache coherence in multiprocessor Synchronisation; Interconnection networks; Benchmarks and advanced topics; Project.",
            "prereqs_parsed": [],
            "type": "DE"
        },
        {
            "code": "ELL411",
            "name": "Digital Communications",
            "prereqs": "[ELL311]",
            "overlap": "ELL712",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 2
            },
            "description": "Matched Filter, Error Rate due to Noise. Intersymbol Interference, Nyquist’s Criterion, Duobinary Signaling. optimum Linear Receiver, Geometric Representation of Signals. Coherent Detection of Signals in Noise, Probability of Error. Coherent Digital Modulation Schemes: MPSK, MFSK, MQAM; Error Analysis. Noncoherent FSK, Differential PSK. Comparison of Digital Modulation Schemes, Bandwidth Efficiency. Pseudo-Noise Sequences and Spread Spectrum, Trellis coded modulation, Digital signaling over fading multipath channels, oFDM communications systems.",
            "prereqs_parsed": [
                [
                    "ELL311"
                ]
            ],
            "type": "DE"
        },
        {
            "code": "ELL703",
            "name": "Optimal Control Theory",
            "prereqs": "[ELL700 or ELL333]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Maximization of functionals of a single and several functions using calculus of variations, Constrained extremals, Euler-Lagrange Equation, Necessary conditions for optimal control, Pontryagin’s minimum principle and state inequality constraints, Minimum time problems, Minimum control effort problems, Linear quadratic regulator problems, Riccati Equation, Singular intervals in optimal control problems, The principle of optimality, Application of the principle of optimality to decision making, Dynamic programming applied to routing problems,  Solving optimal control problems using dynamic programming, Discrete linear regulator problem, Hamilton -Jacobi -Bellman Equation, Numerical Techniques to determine optimal trajectories.",
            "prereqs_parsed": [
                [
                    "ELL700",
                    "ELL333"
                ]
            ],
            "type": "DE"
        },
        {
            "code": "ELL710",
            "name": "Coding Theory",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Measure of information, Source coding, Communication channel models, Channel Capacity and coding, Linear Block codes, Low Density Parity Check (LDPC) Codes, Bounds on minimum distance, Cyclic codes, BCH codes, Reed Solomon Codes, Convolutional codes, Trellis coded Modulation, Viterbi decoding, Turbo codes, Introduction to Space-Time Codes and Introduction to Cryptography. If time permits, LDPC/Turbo codes in the wireless standards. There are no laboratory or design activities involved with this course.",
            "prereqs_parsed": [],
            "type": "DE"
        },
        {
            "code": "ELL715",
            "name": "Digital Image Processing",
            "prereqs": "[]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 2
            },
            "description": "Introduction to 2-D Signals and Systems. Image Digitization. Image Transforms. Image Enhancement: Image Restoration: Inverse Filtering, Algebraic Approach to Restoration, Wiener (LMS) approach, Constrained Least Squares Restoration, Adaptive methods for restoration. Image Reconstruction: The Filtered Back- Projection Algorithm, Algebraic Reconstruction Method. Image Segmentation: Detection of Discontinuities, Edge Linking and Boundary Detection, Thresholding, Region-oriented Segmentation. object representation and description: Boundary descriptors, region descriptors, HoG and SIFT based features. Colour Image processing: colour models, colour transformations, and processing techniques.",
            "prereqs_parsed": [],
            "type": "DE"
        },
        {
            "code": "ELL716",
            "name": "Telecommunication Switching and Transmission",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Wireline access circuits, long haul circuits, signaling, switching exchanges, analysis of telecom switching networks, teletraffic engineering, management protocols, multi-service telecom protocols and networks.",
            "prereqs_parsed": [],
            "type": "DE"
        },
        {
            "code": "ELL724",
            "name": "Multichannel Signal Processing",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Wave Propagation: Wave equation, plane and spherical wave solution in Cartesian co-ordinate system, wave solution in spherical co-ordinate system, Introduction of Spherical Harmonics. Mathematical Preliminaries of ASP: Linear Algebra Basics, Array Signal Processing Basics, optimization Algorithms. Acoustic Source Localization: Data model, correlation and subspace based (MuSIC, root-MuSIC) localization, wideband and narrowband source localization. Source activity detection, Localization and Tracking. Brain Source Localization for BCI Control: Introduction of Head harmonics for brain source localization (BSL), Application of BSL in BCI control, and physiological shape description for medical application. Source Estimation: Fixed beamforming, Null steering, adaptive beamforming, Beampattern Design: Robust/non-robust, Frequency invariant, least square, Joint optimization. Multichannel Signal Enhancement: Time and frequency domain-based enhancement, Joint Diagonalization, Noise rejection, Binary Masking and beamforming. More Application: Source separation, Dereverberation",
            "prereqs_parsed": [],
            "type": "DE"
        },
        {
            "code": "ELL725",
            "name": "Wireless Communications",
            "prereqs": "[ELL712]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "The wireless channel (physical modeling, linear time-varying system, discrete-time baseband model, time and frequency coherence), point- to-point communication (detection, diversity, spatial multiplexing), cellular systems (multiple access and interference management), capacity of point-to-point wireless channels (single and multi- antenna), capacity of single-antenna multiuser channels, point- to-point multi-antenna (MIMo) channels and spatial multiplexing, point-to-point MIMo capacity and multiplexing architectures.",
            "prereqs_parsed": [
                [
                    "ELL712"
                ]
            ],
            "type": "DE"
        },
        {
            "code": "ELL730",
            "name": "I.C. Technology",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Course Introduction, Modern Semiconductor IC fabrication Industrial/ Academic Landscape; Overview of modern CMOS process flow – basic steps; Crystal growth and wafer basics; Cleanroom basics – environment, infrastructure, advanced MoS cleaning, getering etc. Lithography; oxidation; Diffusion; Ion-Implantation; Thin-Film Deposition; Etching; Backend processes; Process Simulation- tools, techniques and methods; Advanced device fabrication concepts – I (SoI, FDSoI, etc); Advanced device fabrication concepts – II (organic, PV, hetero); Advanced device fabrication concepts – III (CNTs, Self-assembly etc).",
            "prereqs_parsed": [],
            "type": "DE"
        },
        {
            "code": "ELL738",
            "name": "Micro and Nano Photonics",
            "prereqs": "[PYL101]",
            "overlap": "PYL795",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Ray optics; Wave optics: Plane Waves, Spherical Waves, Interference, Diffraction; Paraxial Waves; Beam optics; Fabry Perot Cavity; Microresonators - Ring Resonators, Disc Resonators; Review of Electromagnetic (EM) Theory; Boundary Conditions; and some relevant EM problems; FDTD and FEM modeling; Fundamentals of Plasmonics - Surface Plasmon Resonance, Dispersion relation, Plasmon coupling conditions, Plasmonic gratings, Models describing the refractive index of metals; Localized Surface Plasmon Resonance; Plasmonic Sensors and Devices; Surface-enhanced Raman Scattering; Plasmonic waveguides and Interconnects; Photonic Crystals and Devices.",
            "prereqs_parsed": [
                [
                    "PYL101"
                ]
            ],
            "type": "DE"
        },
        {
            "code": "ELL740",
            "name": "Compact Modeling of Semiconductor Devices",
            "prereqs": "[(MoS or Microelectronics) and any]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "or Physical Electronics or VLSI technology Introduction to AMS enablement and PDK elements, Basics of semiconductor devices, Device modeling tools-TCAD and SPICE, Diode modeling, Resistor modeling, FEoL capacitor modeling, Advanced CMoS Technology, MoS transistor modeling, modeling of process variations, Mismatch and corners.",
            "prereqs_parsed": [],
            "type": "DE"
        },
        {
            "code": "ELL758",
            "name": "Power Quality",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Overview and definition of power quality (PQ), Sources of pollution, International power quality standards, and regulations. Power quality monitoring. Power quality problems. Loads which causes power quality problems. Power factor correction, zero voltage regulation, reactive power compensation, load balancing using load compensation techniques: passive shunt and series compensation, DSTATCoM (Distribution Static Compensators), DVR (Dynamic Voltage Restorers), uPQC (universal Power Quality Conditioners). Harmonic effects- within the power system, interference with communication Harmonic measurements. Harmonic elimination-using active (shunt, series and hybrid) and passive (shunt and series) filters. Improved power quality converters: single ac-dc converters, bridgeless isolated converter, bridgeless non-isolated converters, multi-pulse converters, multilevel converters, line commutated converters, power quality improvement in SMPS, uPS, drives, welding systems, lighting systems, and renewable energy systems.",
            "prereqs_parsed": [],
            "type": "DE"
        },
        {
            "code": "ELL765",
            "name": "Smart Grid Technology",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Introduction:- Smart Grid an overview; Components of Smart Grid; Intelligent Appliances; Smart Substations; Smart Distributions- Generations; Smart Power meters; universal Access (wind, solar, hydro etc.) Smart Grid Technologies:  Integrated Communications; Sensing and Measurement; Advance Control Methods; Advance components and Improved Interfaces and Decision Support. Benefits of Smart Grid: Self-Healing; Power Quality Improvement; utilization of all generation and storage options; optimized use of assets and efficient Operation. Miscellaneous: Smart Grid Challenges; Smart Grid Projects; Contribution of Microgrid in development of Smart Grid.",
            "prereqs_parsed": [],
            "type": "DE"
        },
        {
            "code": "ELS310",
            "name": "Independent Study (EE1)",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 0,
                "tutorial": 3,
                "practical": 0
            },
            "description": "",
            "prereqs_parsed": [],
            "type": "DE"
        },
        {
            "code": "ELP303",
            "name": "Power Engineering Laboratory",
            "prereqs": "[ELL303]",
            "overlap": "",
            "credits": 1.5,
            "hours": {
                "lecture": 0,
                "tutorial": 0,
                "practical": 3
            },
            "description": "Experiments will be conducted on 3-phase alternators and transformers for measuring their sequence impedance. Directional, overcurrent and differential protection relays will be studied. Computer simulation for power flow, short circuit and stability studies of interconnected power systems. Numerical relays and synchrophasors will be introduced. FACTS devices will be experimented.",
            "prereqs_parsed": [
                [
                    "ELL303"
                ]
            ],
            "type": "Core"
        },
        {
            "code": "HUL211",
            "name": "Introduction to Economics",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "Current economic problems. Alternative economic systems. An overview of the economy. The market mechanism. National product and income. Consumption, savings and investment. Determination of national income. Aggregate demand and supply. Fiscal policy. The nature of money and monetary policy. Inflation and unemployment. Basic concepts of price theory. Determination of price by supply and demand. Elasticity of demand and supply. Theory of production. Theory of costs. Pricing in competitive and monopoly markets. The gains from international trade. Theory of exchange rates. Balance of payments. Economic growth, and development. Inequality and poverty.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL212",
            "name": "Microeconomics",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "Micro versus macroeconomics. Theory of consumer behavior and demand. Consumer preferences. Indifference curve. Consumer equilibrium. Demand function. Income and substitution effects. The Slutsky equation. Market demand. Elasticities. Average and marginal revenue. Revealed preference theory of firm. Production functions. Law of variable proportions. Laws of return to scale. Isoquants. Input substitution. Equilibrium of the firm. Expansion path. Cost function. Theory of costs. Short Run and Long run costs. Shape of LAC. Economies and diseconomies of scale. Market equilibrium under perfect competition. Equilibrium under alternative forms of market. Monopoly: pure and discriminating. Monopolistic competition. oligopoly.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL213",
            "name": "Macroeconomics",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "Major economic problems. National income accounting. Expenditure and income approaches to GNP. Measuring inflation and unemployment. Determination of the equilibrium level of income. Consumption function. Investment demand. Aggregate demand and equilibrium output. The multiplier process. Government sector. Fiscal policy. Tax receipts and Transfer payments. Foreign spending. Money, interest and income. Functions of money. Definition of money. Reserve Bank of India and Commercial Banks. Creation of money. The instruments of monetary control. The demand for money. Investment expenditure and rate of interest. The IS curve. Money market and the LM curve. Liquidity trap. The IS-LM model. Derivation of the aggregate demand curve. Monetary and fiscal polices. Keynesian versus monetarist views. The aggregate supply function: Keynesian and classical. Inflation and unemployment. Stagflation. The Phillips curve. The long-run Phillips curve. Inflation expectations. The rational expectations.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL217",
            "name": "History of Economic Thought",
            "prereqs": "[]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "This course will introduce ideas in the history of economic thought, from mercantilism, socialism, communism, capitalism to the rise of modern economic theory (e.g. utiliarianism), along with questions about economic theory (especially from behavioural sciences).",
            "prereqs_parsed": [],
            "type": "HUL2XX"
        },
        {
            "code": "HUL232",
            "name": "Modern Indian Fiction in Translation",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "Students would be introduced to the conditions, beginning in 19th century colonial rule in India, which led to the emergent Indian middle-class intelligentsia to experiment with European forms of literature but striving for an alternative expression. Indian languages became the medium through which writers sought to address issues of identity, tradition, modernity, gender, the rural and the urban, the private and the public. The course will study the various experiments in narration, language, characterization and style undertaken by authors to shape these themes.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL235",
            "name": "Rise of the Novel",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "The socio-politcal contexts which lead to the rise of the novel in Europe – the emergence of print, the expansion of literacy, and the establishment of capitalism. Close reading of selected texts accompanying concepts like the rise of the modern individual, varied narrative techniques and national consciousness. The emerging sub- genres of the novel – the comic, the picaresque, the historical novel and the realist novel. The linkage of the novel to the colonial project and its influence on world literature.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL236",
            "name": "Introduction to Drama",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "Brief history of the development and importance of drama in Western and Indian contexts. Readings from both ancient and contemporary drama theorists. Generic differences between different forms of drama such as tragedy, comedy, realist, ‘folk’, Absurd, etc. Detailed study of important examples of different forms of drama.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL237",
            "name": "Contemporary Fiction",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "- Approaches to contemporary fiction - Looking at contemporary styles - realism, modernism, postmodernism - Contemporary versions of classical genres - the diary, epistolary form, epic, etc. - the relationship of society with science and technology through fiction - the relationship between self and society through fiction -Race, nationality, culture and identity - contemporary forms.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL239",
            "name": "Indian Fiction in English",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "The course involves a detailed study of 3-4 texts corresponding to the distinct phases of literary activity in the genre: the early period of the 1940s and 50s in which writers like Mulk Raj Anand, Raja Rao and R.K. Narayan made their presence felt, before Salman Rushdie, and more quietly, Amitav Ghosh and Vikram Seth, erupted into the scene in the 1980s, spawning a generation of writers attaining international acclaim - Arundhati Roy, Aravind Adiga, Kiran Desai, and many others. Some of the questions that will be addressed are: Who constitutes the main audience for this writing, and (how) does the writing cater to it? How does one position the expatriate Indian writer both residing and publishing abroad? How does English become an Indian language? Is there a thematic congruence in the novels that fall under this category, and does it differ from the thematic concerns of novels written in other Indian languages? Students will be encouraged to read a novel in at least one other Indian language in order to allow them to pose these questions in a more pointed manner.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL240",
            "name": "Indian English Poetry",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "The aim of this course will be to read the poems of Indian English  Writers (pre and post-Independence), with specific reference to the articulation of their identity. Some of the perspectives from which the poems will be discussed include the notion of home (childhood, family and ancestors); land (history, geography, community, caste and contemporary politics); language (the dialogue between the different languages in the creative repertoire of the poets); and culture (ritual, traditions, legends and myths). The course will also look at the differences between the resident and expatriate poets vis-a-vis the conflicts and resolutions as expressed in their poems.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL242",
            "name": "Fundamentals of language sciences",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "This course provides answers to basic questions about the nature and constitution of human language in the mind/brain of native speakers. Varied aspects of linguistic organization, including structures of sounds, words and sentences are considered to understand the core universals of all languages as well as their variations. Cases of feral children, language deficiencies and cognition-language interactions are also highlighted.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL243",
            "name": "Language and Communication",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "This course offers a wide-ranging introduction to, and analysis of, varieties of spoken and written language. From political oratory to examination answer scripts to computer codes, not to mention jokes, riddles and poetry, human language offers an amazingly rich set of structures for expressing and conveying our thoughts, intentions and desires. The course will consider some of these linguistic structures and communicative strategies in detail, beginning with early childhood development. How is it that children in every culture learn language so effortlessly despite its great complexity? The course aims to introduce students to a set of theories that address this and other puzzles and mysteries in the arena of language studies. Finally, since a central focus of the course is communication, it will strive to be as interactive as possible, with lots of scope for the discussion and working out of actual ‘problems’ in language use.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL251",
            "name": "Introduction to Logic",
            "prereqs": "[]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "In this course, students are introduced to fundamentals of informal logic and verbal analysis, material and formal fallacies of reasoning often found in ordinary discourse, deductive and Inductive reasoning, validity and soundness, formal rules and principles of the deductive system of Aristotelian logic, traditional square of opposition; propositional calculus; first order predicate calculus; the modern square of opposition and the problem of existential import; identity and definite descriptions; methods for formulating natural language arguments in symbolic forms and techniques for checking their validity; various meta-logical theorems and their proofs.",
            "prereqs_parsed": [],
            "type": "HUL2XX"
        },
        {
            "code": "HUL253",
            "name": "Moral Literacy and Moral choices",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "This is primarily a course in applied ethics. It will focus primarily on questions like: What is the meaning of right action? Can ethical assertions be true or false? Is morality relative to society? or can we say that acts have universal moral content? The course discussions will help to demonstrate that morality is not always self-evident and that rational morality must come in place of taboo based moralities.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL256",
            "name": "Critical Thinking",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "What makes philosophical thinking radically critical? Investigation of the nature of knowledge about the world and justification of knowledge claims. Metaphysical understanding of the Absolute  and Mind-Body relation. The nature of ethical and aesthetic beliefs and attitudes as part of understanding the nature of values. The discussion of the above issues will be influenced by three philosophical orientational perspectives: Anglo-American Analytic, Continental Phenomenological and Classical Indian.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL258",
            "name": "Social and Political Philosophy",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "As closely aligned areas in philosophy– social philosophy with the role of individual in society and political philosophy with the role of government- this course bridges divides between social theory, political philosophy, and the history of social and political thought as also between empirical and normative analysis through perspectives from metaphysics, epistemology and axiology. A range of socio- political thinkers, theories and concepts will be taught. It will provide a broad survey of fundamental social and political questions in current contexts discussing philosophical issues central to political thought and radical critiques of current political theories.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL261",
            "name": "Introduction to Psychology",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "Psychological Science- Assumptions, schools, methods of doing psychology research, The relationship between brain, body and mental functioning, Sensation, perception and making sense of the world, Consciousness, Life span development and motor and language development, Nature and nurture controversy, The learning process and some important explanations of how we learn, Meaning of motivation and explanations, Theories of emotions and expression and regulation of emotions, Basic cognitive processes, Language development, why we remember and why we forget- some explanations, Different kinds of intelligence, explanations of creativity, Differences among individuals and explanations for personality differences, Application of psychology to everyday life- enhancing health and well-being, performance, social relations, and sensitivity to environmental, social and cultural contexts.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL265",
            "name": "Theories of Personality",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "Personality: Meaning & Assessment. Psychoanalytic & Neo- Psychoanalytic Approach ; Behavioural Approach; Cognitive Approach; Social- Cognitive Approach; Humanistic Approach; The Traits Approach; Models of healthy personality: the notion of the mature person, the self-actualizing personality etc. Personality disorders; Psychotherapeutic techniques and Yoga & Meditation; Indian perspective on personality; Personality in Socio- cultural context.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL267",
            "name": "Positive Psychology",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "Positive Psychology: A historical and contextual overview; Relationship between Indian Psychology and Positive Psychology; Correlates and predictors of life satisfaction and subjective well-being across various cultures; Latest researches on self-esteem, optimism, flow, post- traumatic growth, positive ageing, character strengths, etc.; Major  theories and models within positive psychology – Self-Determination theory, Broaden-and-Build theory, Authentic Happiness, Psychological Well-being, etc., Interpersonal character strengths & well- being; Specific Coping Approaches: meditation, yoga and spirituality; Future of the Field.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL271",
            "name": "Introduction to Sociology",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "Introduction to the discipline of sociology and its emergence as a science in the context of the development of modern industrial society in Europe. Introduction to key classical and contemporary theorists in Sociology.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL272",
            "name": "Introduction to Sociology of India",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "This course will begin with a discussion on the various constructions of Indian society from colonial to contemporary times. The structural and cultural dimensions of Indian society are explored at the level of village, city, region, nation and civilization. Sources of differentiation, diversity and unity are explored through institutions such as caste, class and tribe; kinship, family, marriage and gender systems, religious traditions and political organisations. Transformations in these institutions are analysed and fault lines explored by studying contemporary issues of secularism, communalism, religious conversions, caste and identity movements. The sociological perspective remains key to interpreting changes in Indian society in the era of globalization and rapid economic change.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL274",
            "name": "Re-thinking the Indian Tradition",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "The examination of sources, the structure, the texts and exemplars of the Indian tradition provide the theoretical framework for the discussion of contemporary political and social issues. These are economic development and social justice religion and the nation, communalism and secularism, caste class and gender equity and so on. The political misuse of tradition in programs of reform and revival both in the past and in modern times will be highlighted to underline the need for rethinking tradition in an academically serious manner.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL275",
            "name": "Environment, Development and Society",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "Students will be exposed to contemporary themes and debates on connection between environment, development, and society; industrialization and risk society; challenge of sustainable development; perception of the environment, dependence for livelihood, identity, and power on natural resources; social ecology; what is the role of religion in determining our world view and relation with the environment?; recognition of indigenous knowledge; rise of environmental movements, development projects and recent conflict over natural resources; understanding major environmental disasters and industrial accidents; global climate change negotiations; gender and environment.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL276",
            "name": "Sociology of Knowledge",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "The de-mystification of science as a privileged form of knowledge since Copernicus. Re-examining the laboratory, the factory and the nation-state, structures linked to the West-European model of science. Examining systems deemed ethno-science or folk-lore, to set up a dialogue with institutionalized science. Comparing science with religion as forms of knowledge having competing power over human belief and action. Examining Traditional Knowledge (TK) systems and their relevance for global economy.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL281",
            "name": "Technology and Governance",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "The course will begin with theories and concepts on the use of technologies to improve governance such as efficiency, transparency, empowerment, economic gains, decentralization etc. It will discuss the concepts of democracy and governance, corruption and accountability. Examples and case studies from topics such as information and communication technologies for development, electronic governance, electronic voting, electronic databases (uID), web portals, community radio etc. Public-private partnerships, regulation of technology by the state, surveillance, and the role of stakeholders in the policy making process.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL282",
            "name": "System and Structure: An Introduction to",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "Communication Theory This course is an introduction to theories of communication for which there is not sufficient time in the other communication courses, which are mainly applied in their orientation. This is an interdisciplinary course. It will examine how the notion of communication is used in different disciplines in the humanities and the social sciences. It will intersect with problems of organizational structure, linguistic structure, interpersonal structure and the problem of what is involved in changing a structure. This course will include no components of remedial English, business correspondence or skill building activities. only those really interested in theoretical questions should enroll.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL286",
            "name": "Social Science Approaches to Development",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "Distinction between ‘growth’ and ‘development’; historical genesis and evolution of the concept of development; theories of development and underdevelopment; the political nature of the development process. Role of state, market, culture and civil society in development. Gendered nature of development. Post-independence Indian experience (centralized planning and socialism) of development; selected comparisons with China, East Asia, South Asia, Africa, Latin America. Explaining India’s slow progress in human and social development, poor record in reduction of poverty and inequality. Impact of globalization, foreign aid and economic reform on India’s development. Experiments with decentralization and sustainable development.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL289",
            "name": "Science, Technology and Human Development",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "The course will begin by identifying various dimensions of human development and mapping the state of India and the world on these indicators. It will then discuss theories about how science and technology (S&T) have shaped human development historically and the dynamics of technological change. Relationship between innovation and human development will be discussed using examples from the appropriate technology movement, health, education, nutrition, energy, environment, and others. Gender dimensions of S&T, indigenous knowledge, and radical critiques of S&T will be discussed.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "HUL290",
            "name": "Technology and Culture",
            "prereqs": "[NLN101]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 1,
                "practical": 0
            },
            "description": "To examine the relationship between technology and culture through a consideration of modern/current developments in various specific areas: e.g. Biotechnology and Medicine, IT, AI & Robotics, Fashion Technology, Magic Technology, Communications, Defense and Space Research. To focus on the roles played by the IITs themselves in creating ‘knowledge societies’ - that is, in influencing, formulating and envisioning the links between technological ‘solutions’ and socio-cultural ‘problems’ especially in the Indian context. Here we  will discuss, for example: Patent Laws, Gender Issues, Environmental Ethics, Design(er) and Person(al) Technological Aesthetics, Technologies for the Disabled, Educational Technologies.",
            "prereqs_parsed": [
                [
                    "NLN101"
                ]
            ],
            "type": "HUL2XX"
        },
        {
            "code": "ELP101",
            "name": "Introduction to Electrical Engineering",
            "prereqs": "[]",
            "overlap": "",
            "credits": 0,
            "hours": {
                "lecture": 0,
                "tutorial": 0,
                "practical": 0
            },
            "description": "(Laboratory) 1 Credit (0-0-2) CRO (mechanism and usage). KCL, KVL, Network theorem verification. Step/transient response of RL, RC, RLC, circuits. Steady state response of Circuits of sinusoidal excitation. Diode experiment (clipping, clamping and rectification). Basic circuits using opamp. Transformers oC and SC tests. BH loop in an iron core, DC and AC motor – for observation only. A small mini-project.",
            "prereqs_parsed": [],
            "type": "Core"
        },
        {
            "code": "PYP100",
            "name": "Physics Laboratory",
            "prereqs": "[]",
            "overlap": "",
            "credits": 2.0,
            "hours": {
                "lecture": 0,
                "tutorial": 0,
                "practical": 4
            },
            "description": "Experiments based on Design and Study of Power sources, Charging and discharging of a capacitor, Electromagnetic Induction, Phase Measurement. Experiments on geometrical and wave optics including interference, diffraction, dispersion and polarization. Experiments based on mechanics, heat, sound, fluids, resonance, like linear air track, coupled pendulum and oscillators, thermal conductivity, elasticity. Experiments in the area of modern physics, like Planck’s constant, lasers, semiconductor band gap, wave motion, mechanical transmission lines.",
            "prereqs_parsed": [],
            "type": "Core"
        },
        {
            "code": "MCP101",
            "name": "Product Realization through Manufacturing",
            "prereqs": "[]",
            "overlap": "",
            "credits": 2.0,
            "hours": {
                "lecture": 0,
                "tutorial": 0,
                "practical": 4
            },
            "description": "Exposing role of manufacturing processes in product realization; understanding product realization by endeavouring hands on activities; Experience of product realization by undertaking manufacturing exercises and assembly activity in teams.",
            "prereqs_parsed": [],
            "type": "Core"
        }
    ],
    "8": [
        {
            "code": "HUL310",
            "name": "Selected Topics in Policy Studies",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Allocation Preferences : HUL281, HUL289, HUL290 The course will introduce students to selected topics in Policy Studies as decided by the instructor.",
            "prereqs_parsed": [],
            "type": "HUL3XX"
        },
        {
            "code": "HUL311",
            "name": "Applied Game Theory",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Allocation Preferences : HUL211, HUL212, HUL213 This module introduces students in economics and other social sciences to game theory, a theory of interactive decision making. This module provides students with the basic solution concepts for different types of non-cooperative games, including static and dynamic games under complete and incomplete information. The basic solution concepts that this module covers are Nash equilibrium, subgame perfect equilibrium, Bayesian equilibrium, and perfect Bayesian equilibrium. This module emphasizes the applications of game theory to economics, such as duopolies, bargaining, and auctions.",
            "prereqs_parsed": [],
            "type": "HUL3XX"
        },
        {
            "code": "HUL312",
            "name": "Distribution and Growth",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Allocation Preferences : HUL211, HUL212, HUL213 Though empirical questions are central in motivating the issues on distribution, this course will mostly draw from theory. Papers published in established journals will cover the major references for this course. It will start from some empirical pattern of development (Kuznet’s hypothesis), country experiences, etc. to motivate the subject. Then it will try to understand the process of distribution, growth and structural change using standard macroeconomic models. This course will be heavily dependent on Mathematics - mainly calculus.",
            "prereqs_parsed": [],
            "type": "HUL3XX"
        },
        {
            "code": "HUL314",
            "name": "International Economics",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Allocation Preferences : HUL211, HUL212, HUL213 Basic concepts of national income accounting, money, and balance of payments; output and exchange-rate determination under fixed and flexible exchange-rate regimes; fiscal and monetary policies in an open economy; international capital movements and their impacts; Case Studies: East Asian crisis, global financial crisis; theories of international trade including factor-proportions and economies of scale; the international trading regime and its implications for developing countries.",
            "prereqs_parsed": [],
            "type": "HUL3XX"
        },
        {
            "code": "HUL315",
            "name": "Econometric Methods",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Allocation Preferences : HUL211, HUL212, HUL213 Basics of sample survey; variance and covariance; correlation coefficient; simple regression analysis; Gauss-Markov theorem; estimation of regression coefficients; confidence intervals and hypothesis testing in regression analysis; type-I and type-II errors; transformation of variables; multiple regression analysis; multicollinearity, heteroscedaticity, dummy variables, basics of time- series analysis.",
            "prereqs_parsed": [],
            "type": "HUL3XX"
        },
        {
            "code": "HUL316",
            "name": "Indian Economic Problems and Policies",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Allocation Preferences : HUL211, HUL212, HUL213  The course is aimed at developing an understanding of the economic issues in a range of economic activities in the Indian economy. The themes that can be covered include performance of the Indian Economy since 1951, agricultural growth in India, inter-regional variation in growth of output and productivity, farm price policy, recent trends in industrial growth, industrial and licensing policy, policy changes for industrial growth, economic reforms and liberalization, population growth, unemployment, food and nutrition security, and education. It will also include some contemporary issues.",
            "prereqs_parsed": [],
            "type": "HUL3XX"
        },
        {
            "code": "HUL318",
            "name": "Public Finance and Public Economics",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Allocation Preferences : HUL211, HUL212, HUL213 The course is aimed at developing an understanding of the basics in Public Economics and Public Finance. Public economics is the study of government policy from the points of view of economic efficiency and equity. The course deals with the nature of government intervention and its implications for allocation, distribution and stabilization. Inherently, this study involves a formal analysis of government taxation and expenditures. The subject encompasses a host of topics including public goods, market failures and externalities. The course is divided into two sections, one dealing with the theory of public economics and the other with the Indian public finances.",
            "prereqs_parsed": [],
            "type": "HUL3XX"
        },
        {
            "code": "HUL320",
            "name": "Selected Topics in Economics",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Allocation Preferences : HUL211, HUL212, HUL213 The course will introduce students to selected topics in Economics as decided by the instructor.",
            "prereqs_parsed": [],
            "type": "HUL3XX"
        },
        {
            "code": "HUL331",
            "name": "Modernist Fiction",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Allocation Preferences : HUL231, HUL232, HUL235, HUL236, HUL237, HUL240, HUL239 The course will undertake a detailed study of some of the most iconic Modernist novels by writers such as Virginia Woolf, James Joyce, Franz Kafka and Samuel Beckett. It will examine the radical new ways in which they grappled with language, turned towards interiority, and pushed, in the process, narrative art to its very limits. The discussion will highlight the experimental quality of Modernist literature, as well as situate it within the context of its emergence - the two world wars, the development of psychoanalysis, the growth of metropolitan cities, and scientific and technological advancements.",
            "prereqs_parsed": [],
            "type": "HUL3XX"
        },
        {
            "code": "HUL332",
            "name": "Fantasy Literature",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Allocation Preferences : HUL231, HUL232, HUL235, HUL236, HUL237, HUL240, HUL239 Major Themes of Fantasy: Archetypes and Myths; Motifs - journeys, theology, devices and aides; creation of alternate worlds; treatment of time and space; close readings of individual texts.",
            "prereqs_parsed": [],
            "type": "HUL3XX"
        },
        {
            "code": "HUL333",
            "name": "Theatre of the absurd",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Allocation Preferences : HUL231, HUL232, HUL235, HUL236, HUL237, HUL240, HUL239 Socio-political background of the theatre of the Absurd, its basis in Existentialist philosophy. The reactions against the conventions of realist theater that dominated this theatre. The pre-occupations of major playwrights with issues of language and the difficulty of communication, the isolation that human beings tend to feel from each other and themes of violence.",
            "prereqs_parsed": [],
            "type": "HUL3XX"
        },
        {
            "code": "HUL334",
            "name": "From Text to Film",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Allocation Preferences : HUL231, HUL232, HUL235, HUL236, HUL237, HUL240, HUL239 The course will involve a detailed study of 3-4 texts and their corresponding adaptations into film. By means of close reading, analysis, and discussion, it will seek to identify the changes that take place during the process of adapting one art-form into another and ask why those modifications occur. An evaluation of what each art-form enables and what it restricts or denies will enable a better understanding of form per se, and of these two forms in particular. Further, the course will address the question of genre and its conventions especially with regard to film, and observe the extent to which generic expectations shape the process of adaptation of text into film. Film screenings will be held outside class hours in the evenings.",
            "prereqs_parsed": [],
            "type": "HUL3XX"
        },
        {
            "code": "HUL335",
            "name": "Indian Theatre",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Allocation Preferences : HUL231, HUL232, HUL235, HUL236, HUL237, HUL240, HUL239 This course will study the various aspects of Indian theatre. The linkages between ancient theatre forms and existing forms of indigenous performance in various parts of India – such as the nautanki, the tamasha and the jatra. The energies which were generated in the urban centres through the encounter with European drama – the Parsi theatre, the nascent Marathi stage, the Hindi theatre of Bhartendu Harishchandra and the nationalist theatre of Calcutta – will be explored. Special attention would be paid to the transformation of theatre values with the intervention of the Indian People’s Theatre Association (IPTA). The focus for the post-Independence period would be on the diverse energies of urban theatre, group theatre and the ‘back to the roots’ movement. The course would require students to study play-scripts as well as look at accompanying literature to form a concrete idea of the philosophy behind Indian theatrical practice.",
            "prereqs_parsed": [],
            "type": "HUL3XX"
        },
        {
            "code": "HUL336",
            "name": "Workshop in Creative Writing",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Allocation Preferences : HUL231, HUL232, HUL235, HUL236, HUL237, HUL240, HUL239 The course will begin by seeking to distinguish the notion of ‘creative’ writing. It will contrast this heterogeneous category with other kinds of writing such as the ‘functional’ writing found in text-books and reportage. Through an analysis of various techniques of writing - in master-texts as well as students’ own productions - the course will explore why and how literary texts continue to be a prime source of emotional and intellectual stimulation across cultures. As far as possible, the course will focus on contemporary writing, given that writers write in the ‘here and now’ even as they imagine the future or return to past memories. Selected readings will be used to focus students’ attention on that most difficult of problems: to acquire a style of writing that makes a writer’s ‘voice’ both unique and universal. Finally, students will be required to write in some genre(s) of their choice. These genres will include the classic areas of poetry, fiction and play-writing but will neither exclude non-fiction genres like the essay and biography nor forms of writing thrown up by the ‘new media’ such as blogs, photo-essays and narrative-writing for story- boards and video-games.",
            "prereqs_parsed": [],
            "type": "HUL3XX"
        },
        {
            "code": "HUL338",
            "name": "Functions of Satire",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Allocation Preferences : HUL231, HUL232, HUL235, HUL236, HUL237, HUL240, HUL239, HUL256 Satire is a classical genre that has thrived over the centuries in almost  all languages and cultures, and is found in a range of media. Life, in all aspects, everyday provides grist to the mill of satire, but does satire change anything? How do we define satire? Why is it considered the social genre? What are the contemporary forms of satire? Who can practice satire? It draws upon diverse techniques such as allegory, irony, caricature and laughter. Through analyses of examples, this course will familiarize students with satirical sub-genres and related literary practices, such as parody, burlesque, black humour, the grotesque, coarse humour, high and low comedy. It will examine the structure of satire, its relation with community, democracy and matters of gender, caste race, and religion.",
            "prereqs_parsed": [],
            "type": "HUL3XX"
        },
        {
            "code": "HUL340",
            "name": "Selected Topics in Literature",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Allocation Preferences : HUL231, HUL232, HUL235, HUL236, HUL237, HUL240, HUL239, The course will introduce students to selected topics in Literature as decided by the instructor. HUL341: Meaning in Natural Language Allocation Preferences : HUL242, HUL243, HUL282 This course examines different aspects of meaning/semantics in language. Some specific questions addressed here are: a) what is meaning?, b) how do we use words to convey meanings?, and c) how does our grammatical knowledge interact with the interpretive system? We try to answer these and other questions while introducing students to the formal techniques used in research on the semantics of natural language.",
            "prereqs_parsed": [],
            "type": "HUL3XX"
        },
        {
            "code": "HUL350",
            "name": "Selected Topics in Linguistics",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Allocation Preferences : HUL242, HUL243, HUL282 The course will introduce students to selected topics in Linguistics as decided by the instructor.",
            "prereqs_parsed": [],
            "type": "HUL3XX"
        },
        {
            "code": "HUL351",
            "name": "Philosophy of History",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Allocation Preferences : HUL251, HUL258, HUL253, HUL256 What kind of understanding of the past does history provide? Is it speculative or analytical? What constitutes historical evidence and how does it confine historical understanding? Questions of objectivity are the central focus of this course: that of historians themselves—constructionist and objectivist— as they debate methodological issues and disagreements about the aim of their discipline, and that of philosophers whose interest in history springs from their attention on history’s objectivist ideals and “the objectivity crisis” in history providing a philosophical rationale for reframing the two oppositions that dominate debates about the status of historical knowledge.",
            "prereqs_parsed": [],
            "type": "HUL3XX"
        },
        {
            "code": "HUL352",
            "name": "Problems in Classical Indian Philosophy",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Allocation Preferences : HUL251, HUL258, HUL253, HUL256 The course will begin by exploring the worldview implicit in the Vedas, the upanisads, and the orthodox systems and then move on to the rejection of this entire system in Buddhism and Materialism. Emphasis will be led on the diversity of systems and healthy dialogue between antagonistic schools of thought.  Discussions will focus on the nature of consciousness in relation to cognition of reality, theories of reality in terms of realism and anti-realism; the nature of self and no-self  theory, theories of perceptual knowledge, theories of error; theories of causation and other relations, and key concepts of moral and aesthetic thought. Wherever appropriate, problems will be discussed in comparison with parallel discussions in western philosophy",
            "prereqs_parsed": [],
            "type": "HUL3XX"
        },
        {
            "code": "HUL353",
            "name": "Philosophical Themes in Biological Sciences",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Allocation Preferences : HUL251, HUL258, HUL253, HUL256 This course addresses various philosophical questions that arise from the recent developments in evolutionary biology, genetics, immunology, sociobiology, molecular biology and synthetic biology. How do these developments affect our ideas about life, evolution and the place of man in relation to other living beings. What is the nature of explanation in biological sciences? Does the idea of immunity demand rethinking on the nature of our embodied self? What can biological sciences tell us about healing, pain and death?",
            "prereqs_parsed": [],
            "type": "HUL3XX"
        },
        {
            "code": "HUL354",
            "name": "Art and Technology",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Allocation Preferences: HUL251, HUL258, HUL253, HUL256, HUL290 The course begins by registering the increased presence of technology in contemporary art. We shall keep the experiences of both classical Greece and Classical India alive where art and technology were not clearly separated in the manner familiar to us. By positioning us between these two experiences - classical and contemporary we shall critically examine the complex relationship between art, science and technology which characterizes modernity. The course uses both materials from philosophical aesthetics, philosophy of science and technology. It also discusses the philosophical writings on specific areas like architecture, photography, cinema and digital art.",
            "prereqs_parsed": [],
            "type": "HUL3XX"
        },
        {
            "code": "HUL355",
            "name": "Philosophy and Intellectual History in India",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Allocation Preferences: HUL251, HUL258, HUL253, HUL256, What defines the Indian tradition? Is there a singular Indian tradition or is there a plurality of Indian traditions in the public sphere today? How do these find representation in the modern and textual frameworks? Is modernity antithetical to tradition? The aim of this course is to take up these varied questions along with their nuances to understand and re-negotiate Indian intellectual traditions. In this course, the examination of sources, structure, texts and exemplars from Indian intellectual tradition provide a theoretical framework for the discussion of contemporary political and social issues. Economic development, social justice, religion and the nation, communalism and secularism, caste, class and gender equality are themes to be addressed. The political misuse of tradition in programs of reform and revival both in the past and in modern times will be highlighted to underline the need for rethinking Indian Philosophy and intellectual tradition in an academically rigorous manner. This course will also take into cognisance the intellectual history of the ancient past as it comes through the Vedic thought and its contestations.",
            "prereqs_parsed": [],
            "type": "HUL3XX"
        },
        {
            "code": "HUL356",
            "name": "Buddhism Across Time and Place",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Allocation Preferences: HUL251, HUL258, HUL253, HUL256, Literature on Buddhism and Buddhist literature brings out the historical, philosophical and political synthesis of Buddhism in ever new cultural contexts. Interrogating and contextualizing engagements of Buddhism’s classical roots in modernity will be a key concerns in this course.",
            "prereqs_parsed": [],
            "type": "HUL3XX"
        },
        {
            "code": "HUL357",
            "name": "Philosophy of Science",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Allocation Preferences: HUL251, HUL258, HUL253, HUL256, Science is regarded as the most significant cognitive enterprise of the modern society. In view of this, the course addresses the question what sets science apart from other epistemic activities. Further It concentrates on debates on the nature of scientific methods, logical reconstruction of scientific explanation, the relation between theories and laws on the one hand, and empirical evidence on the other, the nature of the justification and the notion of truth involved in scientific knowledge, and the societal influence on scientific practice.",
            "prereqs_parsed": [],
            "type": "HUL3XX"
        },
        {
            "code": "HUL358",
            "name": "Philosophy of mind",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Allocation Preferences: HUL251, HUL258, HUL253, HUL256, Categorial taxonomy of Mental Phenomena: Intentional and Phenomenal. Theories of the Mind-Body relation: Cartesian Dualism; Behaviourism; Identity Theory or Physicalism; Functionalism. Personal Identity and the Self: The First-person Point of View. Consciousness and Content: Phenomenal Intentionality; Representationalism; Internalism and Externalism about Experience; Qualia and the Knowledge Argument. Consciousness and Self-consciousness: Pre-reflective Self- consciousness; one-level Accounts of Self-consciousness; Temporality and the Limits of Reflective Self-consciousness; Bodily Self-awareness; Social Forms of Self-awareness. Critique of the Computational Theory of Mind: Searle’s Chinese Room Argument and the Frame Problem.",
            "prereqs_parsed": [],
            "type": "HUL3XX"
        },
        {
            "code": "HUL359",
            "name": "Metaphysics of the self",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Allocation Preferences: HUL251, HUL258, HUL253, HUL256 The course is a critical study of the problem of the self taken to be a substance by some and denied to have any substantial reality by others. Focus will be given on examining the worldview from which stems the idea of a continuing self, as a subject of consciousness and agent of action. Questions about whether it is material or immaterial, real or nominal object will centre the ontological investigation into the nature of the self. Special consideration will be given to the issue of self-awareness and self-reference, and its relation to the linguistic phenomenon of the first-person pronoun ‘I’.",
            "prereqs_parsed": [],
            "type": "HUL3XX"
        },
        {
            "code": "HUL360",
            "name": "Selected Topics in Philosophy",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Allocation Preferences: HUL251, HUL258, HUL253, HUL256 The course will introduce students to selected topics in Philosophy as decided by the instructor.",
            "prereqs_parsed": [],
            "type": "HUL3XX"
        },
        {
            "code": "HUL361",
            "name": "Applied Positive Psychology",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Allocation Preferences: HUL261, HUL265, HUL267 Meaning and goals of applied positive psychology; Relevant research methods of the field; Introduction to intervention programmes including internet based intervention; Researches that support intervention strategies : Psychological well-being and its intervention programmes; emotional intelligence and its intervention programmes; Strategies for achieving well-Being; Mindfulness and its intervention programmes; Intervention module on stress and time management; Character strengths : their role in well being; How psychosocial resources enhance health and well being; Intervention researches in Indian socio-cultural context; Current issues and future directions in this Area.",
            "prereqs_parsed": [],
            "type": "HUL3XX"
        },
        {
            "code": "HUL362",
            "name": "Organizational Behaviour",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Allocation Preferences: HUL261, HUL265, HUL267 Introduction to organizational behaviour, Historical development of the field and some challenges in contemporary times, Learning and perceptual processes in organizations and their implications for work-life,Work related attitudes- job satisfaction, organizational commitment, organizational justice, organizational citizenship behaviour, Individual differences related to personality, emotions and abilities and functioning in organization, Group processes in organizations, Formation of groups and teams, Effective teams, Communication in organizations, Social influence processes in organizations, influencing people, power dynamics and politics and impact on organizational functioning, Theories and styles of leadership in organization and their impact on organizational functioning, organizational ethos and culture and its impact on productivity and well- being, Various kinds of organizational structures and their effectiveness, managing organizations in times of change.",
            "prereqs_parsed": [],
            "type": "HUL3XX"
        },
        {
            "code": "HUL363",
            "name": "Community Psychology",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Allocation Preferences: HUL261, HUL265, HUL267 Introduction to Community Psychology; understanding Individuals within Environments; Individualism collectivism & community Psychology; understanding Human Diversity; understanding Coping in Context; Community and Social Change; Prevention and Promotion: Key Concepts, Current and Future Applications & implementing programs; overview of Community Interventions; Social support research in community psychology; Recent community researches in Indian socio- cultural context: Effects of various socio- cultural issues on individual and community well-being.",
            "prereqs_parsed": [],
            "type": "HUL3XX"
        },
        {
            "code": "HUL364",
            "name": "Understanding the Social Being",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Allocation Preferences: HUL261, HUL265, HUL267 The social being- introducing the social psychological approach, Historical roots, theories and methods. Person and social perception and social judgements. Social cognition and social thinking. The social self- cognitive, affective and behavioural aspects of self. Positive social behaviours- altruism, cooperation and volunteerism. Individuals in groups-social facilitation, loafing, conformity, compliance. Social influence, manipulation and power- bases of power. Intergroup relations- explanations and managing intergroup relations. Collective behaviour- crowds and mobs- negative and positive aspects of collective behaviour. Aggression and violence- theories and determinants. Reducing aggression and violence. Applications of social psychology- health and well-being, law and organizational contexts.",
            "prereqs_parsed": [],
            "type": "HUL3XX"
        },
        {
            "code": "HUL365",
            "name": "Environmental Issues: Psychological Analysis",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Allocation Preferences: HUL261, HUL265, HUL267 The implications of natural, built and social environment on human functioning, Making sense of environment-environmental perception and cognition, Nature of environmental attitudes and implications for inculcating pro-environmental attitudes, Various kinds of environmental stressors and human response to these stressors, Psychological analysis of climate change related issues, Psychology and energy conservation- social and collective dilemmas and individual interests, Environmental disasters and disaster preparedness, Assessing environmental risks, Place attachment, territoriality, personal space and notion of privacy and identity issues, Designing better environments and role of psychological factors in the design process, Examining specific built environments.  HUL370: Selected Topics in Psychology Allocation Preferences: HUL261, HUL265, HUL267 The course will introduce students to selected topics in Psychology as decided by the instructor.",
            "prereqs_parsed": [],
            "type": "HUL3XX"
        },
        {
            "code": "HUL371",
            "name": "Science, Technology and Society",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Allocation Preferences: HUL271, HUL272, HUL274 HUL275, HUL276, HUL281, HUL286, HUL289, HUL290 The course will begin with social theories on the production of technology and scientific knowledge systems, stratification within the community of technologists and scientists, discrimination (race, class, gender, caste) and the role of power in shaping the production of technology and scientific knowledge. Scientific controversies, both historical and emerging, and the organization of innovation and its geographies will be discussed. Case studies exploring ethical questions arising from new technologies such as information technology, nanotechnologies, biotechnologies, etc. will be used. Discussions on public understanding of science and role of the public and of experts in influencing policies related to science and technology will conclude the course.",
            "prereqs_parsed": [],
            "type": "HUL3XX"
        },
        {
            "code": "HUL372",
            "name": "Agrarian India: Past and Present",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Allocation Preferences: HUL271, HUL272, HUL274 HUL275, HUL276, HUL286 The course will use interdisciplinary texts to give students a historical overview of agrarian India starting from the colonial period, plantation and export economies, recurring famines, community development programs and land reforms after independence, the green revolution, and the neglect of rainfed / dryland regions. It will explore various dimensions of development in agriculture including the advent of the agricultural sciences and the birth of the agricultural extension system. The myth of the ignorant farmer and the self-sufficient village will be discussed. Case studies on the historical roots of globalization and agricultural commodity chains related to new technologies, and the linkages between the market and the state in contemporary agriculture will be discussed. The growing social and geographical disparity with ecological distress and the threat of climate change, farmer suicides, and debt spirals on the one hand, and a risky but rewarding cash crop economy on the other, will also be explored. Finally the course will discuss aspirations of rural youth, opportunities for livelihoods, and gender and caste dimensions of the growing urbanization of rural centres.",
            "prereqs_parsed": [],
            "type": "HUL3XX"
        },
        {
            "code": "HUL374",
            "name": "Nations and Nationalism",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "The Course is designed to introduce students to a critical  understanding of the nation as a historical and social fact, and nationalism as the feeling of collective belonging to the nation. Building on sociological understanding of collective identity, the course will cover various theories of nationalism and touch upon different aspects of nationalism for instance, race, class, gender, ethnicity, culture, language, sports and religion among others. In an increasingly globalizing world? or does the idea of the nation still arouse anxiety over collective identity? In addition to assigned texts and films, students will be expected to work on in-class activities and assignments designed to further their understanding of the topic.",
            "prereqs_parsed": [],
            "type": "HUL3XX"
        },
        {
            "code": "HUL375",
            "name": "The Sociology of Religion",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Allocation Preferences: HUL271, HUL272, HUL274 HUL275, HUL276, HUL286 This course will introduce students to sociological approaches to the study of religion in contemporary society. Religion will be understood in terms of its social and cultural structure; in addition the course will also encourage a critical perspective on religion and society – its interface with society, polity and the economy. Religious conflict and change, syncretism, popular religion, revivalism and fundamentalism will also be considered.",
            "prereqs_parsed": [],
            "type": "HUL3XX"
        },
        {
            "code": "HUL376",
            "name": "Political Ecology of Water",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Allocation Preferences: HUL271, HUL272, HUL274 HUL275, HUL276, HUL286 This course is an advanced undergraduate sociology course on the political ecology of water. It discusses people’s historic and current engagement with water, sustainable development and water, the recent controversies and emergent resource conflict over water in the context of industrial development, design and implementation of hydropower projects, water pollution management, and conservation strategies (modern and traditional) and relates them to relevant national policies.",
            "prereqs_parsed": [],
            "type": "HUL3XX"
        },
        {
            "code": "HUL377",
            "name": "Gender, Technology and Society",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Allocation Preferences: HUL271, HUL272, HUL274 HUL275, HUL276, HUL286, HUL289, HUL290 The manner in which gender is conceptualized and performed is foundational to the understanding of human social relationships. Gender identities are not fixed or determined purely by physiology; their social construction affects ideas of masculinity and femininity or other sexual identities. Besides understanding how sex and gender are interrelated, we will look at how gender intertwines with societal areas of economy, technology, polity, religion and demography. The important role played by social structures and institutions such as caste, kinship, family, marriage, ethnicity, religion and class in structuring gender and vice-versa will be brought out. Technologies associated with population and biological sciences have transformed and are continuing to transform society and human relationships in particular directions. The course will examine these transformations at the global and local levels and consider their impact on individual lives. Challenges posed to intimate human relationships and identities by new reproductive technologies such as invitro-fertilization, surrogacy, sex selection will be explored. What does the emergence/ institutionalization of new social forms - such as same sex marriages and parenthood by surrogacy - tell us about the possibilities and limits of human relationships?",
            "prereqs_parsed": [],
            "type": "HUL3XX"
        },
        {
            "code": "HUL378",
            "name": "Industry and Work Culture under Globalization",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Allocation Preferences: HUL271, HUL272, HUL274 HUL275, HUL276, HUL286  Globalization and Globality; Classical theories to understanding work and industry; understanding Work, Work Ethic and Work Culture; Post-industrial society and rise of informational economy; Job-satisfaction and alienation; Equalization of opportunities and the Flattening of the World; outsourcing as a Business Strategy; Important changes in industry and rise of IT sector and BPo industry; Governance and Collective organization of Workers in select sectors; Corporate Social Responsibility.",
            "prereqs_parsed": [],
            "type": "HUL3XX"
        },
        {
            "code": "HUL379",
            "name": "Sociological Perspectives on Organisations",
            "prereqs": "[(HUL2XX[0] and HUL2XX[1]) or (HUL3XX[0] and HUL3XX[1]) or ...]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "categories This course trains students to understand the social dynamics of different types of organisations, with a focus on practices of work and the making of workplaces. While familiarising students with the theoretical approaches and concepts necessary to understand the individual as relationship to the organisation, it will enable students to think critically about questions of identity, agency, power and control in organisational spaces. We discuss the interface of culture, ways of thinking, feeling, acting and being in different organisations. This enables a shift from the managerial perspectives and psycho-social views of organisations, and draws out the complex negotiations and tensions endemic to organisational life. The course also draws on literature on different types of organisations such as hospitals, prisons and corporations to elaborate the unique cultural configurations in these spaces and contexts.",
            "prereqs_parsed": [],
            "type": "HUL3XX"
        },
        {
            "code": "HUL380",
            "name": "Selected Topics in Sociology",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Allocation Preferences: HUL271, HUL272, HUL274 HUL275, HUL276, HUL286 The course will introduce students to selected topics in Sociology as decided by the instructor.",
            "prereqs_parsed": [],
            "type": "HUL3XX"
        },
        {
            "code": "HUL381",
            "name": "Mind, Machines and Language",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Allocation Preferences: HUL243 Exploratory in nature, the course seeks to debate questions such as: What are the implications of conceiving the mind as a ‘machine’? Can evolutionary theories about language and tool-using help us understand how we continually manage today to process the world around us ‘online’? On this course, the class will be introduced to some state-of-the-art discussions in the interdisciplinary field of cognitive studies. These topics will include: (i) the modularity of mind (ii) the content of consciousness, (iii) the language bio-programme hypothesis, (iv) the relativism versus universals of controversy; (v) strong and weak positions on AI, etc. The course will rely on down- to-earth examples to demonstrate that such an interconnected area of study is not remote or esoteric but part of the intellectual excitement of living in the new millennium and attempting to anticipate both how it will shape us and how we will shape it.",
            "prereqs_parsed": [],
            "type": "HUL3XX"
        },
        {
            "code": "HUL382",
            "name": "Romanticism: The Theory of Animals, Monsters",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "and Machines Allocation Preferences: HUL231, HUL235 There is more to romanticism than Wordsworth’s poetry, or even literature in general. Nor is it confined between 1780s and 1830s. Least is it a trend succeeded by Victorianism and realism, and assailed by modernism. Romanticism contends with the question of presentation – of representation of and to oneself. It therefore directly participates in the philosophical discussions of reason, sensibility, emotion, subjectivity, and most importantly the idea of human freedom. This course will familiarize students with romantic  movements in arts, in theories of language and society, in post- Kantian philosophy, in attitudes tor religion. Romantics not only engaged in experimental social practices and literary collaborations, but also articulated their necessity for the first time. Can we say that romanticism is at an end? How does it contribute to both a nationalism rooted in folk tradition, and individualism expressed in the cult of the hero, the solitary intellectual? How does it both look back to medieval occult and forward to novelties of science? Why is romanticism fascinated with animals, monsters and machines alike?",
            "prereqs_parsed": [],
            "type": "HUL3XX"
        },
        {
            "code": "ELL301",
            "name": "Electrical and Electronics Instrumentation",
            "prereqs": "[ELL101]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Basics of Measurement and Instrumentation, Instrument Examples: Galvanometer, Accelerometer etc; calibration methods, Voltage and Current Measurements; Theory, calibration, application, Errors and compensation. Power and Energy Measurement and its errors, Methods of correction, LPF wattmeter, Phantom loading, Induction type KWH meter; Calibration of wattmeter, energy meter. Potentiometer and Instrument Transformer :DC and AC potentiometer, C.T. and V.T. construction, theory, operation, characteristics. Digital Instrumentation.",
            "prereqs_parsed": [
                [
                    "ELL101"
                ]
            ],
            "type": "DE"
        },
        {
            "code": "ELL312",
            "name": "Semiconductor Process Technology",
            "prereqs": "[ELL211]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Semiconductor materials (inorganic and organic), history of semiconductor IC devices, crystal structure, defects, vacancies and  interstitials, semiconductor crystal growth, bulk doping methods, purification methods, wafer manufacture, diffusion, surface doping, oxidation, dopant redistribution, ion implantation and annealing, rapid thermal processes, photolithography, masks, photoresists, exposure, e-beam lithography, vacuum systems, gas flow, plasma processes, pumping theory, leaks, vacuum gauges, wet etching, plasma etching, process gas chemistry and polymerization, ion milling, reactive ion etching, lift-off, vapor pressure of materials, evaporation, sputtering, deposition rate and step coverage, codepositions, film growth mechanisms and stress, chemical vapor deposition, metal-organic chemical vapor deposition, atomic layer deposition, molecular beam epitaxy, planarization processes, interconnects, yield and device integration.",
            "prereqs_parsed": [
                [
                    "ELL211"
                ]
            ],
            "type": "DE"
        },
        {
            "code": "ELL313",
            "name": "Antennas and Propagation",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Prerequisites: ELL212 Starting from the principle of radiation different types of antenna; wire, slot, planar and their arrays with feeds. Antenna synthesis and design and measurements. Characteristics of propagation of radio waves in different atmospheric layers and study of the losses, fading and scattering of microwave and millimeter waves in the atmosphere.",
            "prereqs_parsed": [],
            "type": "DE"
        },
        {
            "code": "ELL315",
            "name": "Introduction to Analog Integrated Circuits",
            "prereqs": "[ELL204 and ELL202]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Review of basic amplifiers. Current Mirrors, Reference Current and Voltage Sources. CMOS Operational Amplifier: Structure, Analysis and Design, Frequency Response and Compensation Techniques. Switched Capacitor Circuits: Principles of operation, Filter and non filter applications. Sample and Hold Circuits, Comparators. ADC: Characterization, Types of ADC and their relative merits and demerits, Design issues. DAC: Characterization, Types of DAC and their relative merits and demerits, Design issues.",
            "prereqs_parsed": [
                [
                    "ELL204",
                    "ELL202"
                ]
            ],
            "type": "DE"
        },
        {
            "code": "ELL316",
            "name": "Introduction to VLSI Design",
            "prereqs": "[ELL211]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Basic MoS characteristics; Deep sub-micron; velocity saturation; Dynamic MoS characteristics; parasitics; leakage; sizing; propagation delay; Logical effort, path delay, optimization; Ratio-ed logic, Pass transistor logic and parasitics; Dynamic logic, pulsed sequential logic; Logical synthesis, physical design, layout; Introduction to design of VLSI memories.",
            "prereqs_parsed": [
                [
                    "ELL211"
                ]
            ],
            "type": "DE"
        },
        {
            "code": "ELL318",
            "name": "Digital Hardware Design",
            "prereqs": "[ELL305]",
            "overlap": "CSL316",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Technology basics and digital logic families such as static CMoS, pass transistor, transmission gate, dynamic and domino logic. Advanced sequential logic elements with latch-based design and timing and clocking concepts. Design flows and paradigms. Data path, control and advanced pipeline implementations. Advanced digital arithmetic. Performance evaluation.",
            "prereqs_parsed": [
                [
                    "ELL305"
                ]
            ],
            "type": "DE"
        },
        {
            "code": "ELL319",
            "name": "Digital Signal Processing",
            "prereqs": "[ELL205]",
            "overlap": "ELL720",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 2
            },
            "description": "Review of Signals and Systems, Sampling and data reconstruction processes. Z transforms. Discrete linear systems. Frequency domain design of digital filters. Quantization effects in digital filters. Discrete Fourier transform and FFT algorithms. High speed convolution and its application to digital filtering.",
            "prereqs_parsed": [
                [
                    "ELL205"
                ]
            ],
            "type": "DE"
        },
        {
            "code": "ELL332",
            "name": "Electric Drives",
            "prereqs": "[ELL203]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Basic Concepts: Characteristics and operating modes of drive motors. Starting, braking and speed control of motors. 4 quadrant drives. Types of loads. Torque and associated controls used in process industries. DC Motor Drives: Characteristics, Starting Methods, Braking Methods, Speed Control using Converters and Choppers. Three phase Induction Motor Drives: Characteristics and Equivalent Circuits, Starting Methods, Braking Methods, Speed Control of Cage Rotor Induction Machines using as AC voltage controllers, Voltage- Source and Current-Source Inverters. V-by-F Control and other Control Techniques. Speed Control of Wound-Rotor Induction Machines using Rotor Resistance Variation; Slip-Power Recovery Scheme. Three phase Synchronous Motor Drives: Characteristics and Equivalent Circuits, Starting Methods, Braking Methods, Speed Control in True Synchronous and Self Control Modes. Special Machines: Permanent Magnet Brush-Less Motor Drives, Permanent Magnet Synchronous Motor Drives, Stepper and Reluctance Motor Drives.",
            "prereqs_parsed": [
                [
                    "ELL203"
                ]
            ],
            "type": "DE"
        },
        {
            "code": "ELL333",
            "name": "Multivariable Control",
            "prereqs": "[ELL225]",
            "overlap": "ELL721",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Review of control system fundamentals and basic linear algebra. Introduction to linear dynamical systems and properties. State-space representation and canonical realizations. Relation between state- space and transfer function representations. Similarity transformation. Diagonalization. Jordan canonical form. Matrix exponential and its properties. Solution of state equations. Cayley-Hamilton Theorem, Stability: BIBo and internal. Linearization of nonlinear systems. Controllability and observability. Minimal realization. State feedback and observer design. Linear Quadratic Regulator.",
            "prereqs_parsed": [
                [
                    "ELL225"
                ]
            ],
            "type": "DE"
        },
        {
            "code": "ELL365",
            "name": "Embedded Systems",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "overview of Embedded Systems; Embedded System Architecture: processor example ARM, PIC, etc.; features of digital signal processor; SoC, memory sub system, busstructure (PC 104, I2C, SPI etc.), interfacing protocols (uSB, IrDA etc), testing and debugging, power management; Embedded System Software: Program optimization,Concurrent Programming, Real time Scheduling and I/o management; Networked Embedded Systems: special networking protocols (CAN, Bluetooth); Applications.",
            "prereqs_parsed": [],
            "type": "DE"
        },
        {
            "code": "ELL400",
            "name": "Power Systems Protection",
            "prereqs": "[ELL303]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Fundamentals of Power system protection, philosophy of protective relays, Different types of relays, Introduction to protection elements like CT, PT, CB, Isolator etc, (includes CT and PT class, CB transients, CB rating and testing, Arc extinction in CB), over current relays: Principle, operation and setting, Directional relays : needs and operating principle, Power system components protected using over current relays, Differential relays: Principle, operation and setting, Protection of three phase transformer, bus bar and generator using differential relays, Distance relays : Principle, operation and setting, Simple impedance relay, reactance relay, Mho relay and angle impedance relays, Quadrilateral relays, Transmission line protection using distance relays, Static relays: principle, amplitude comparator and phase comparator, Phase comparator realization using positive coincidence period, Distance relay realization using comparators, Generator protection, overview of Numerical relaying and few algorithms, Phasor extraction, Introduction to PMu and its use, Fault location.",
            "prereqs_parsed": [
                [
                    "ELL303"
                ]
            ],
            "type": "DE"
        },
        {
            "code": "ELL401",
            "name": "Advanced Electromechanics",
            "prereqs": "[ELL203]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Introduction to Advancement in Electromechanics, Permanent Magnet Brushless DC Machines, Permanent Magnet Synchronous Motors, Switched Reluctance Motors, Single-Phase Machines, Axial Field Machines and other Advanced Electrical Machines, Introduction to Control of Advanced Electrical Machines, Applications in Industry, Domestic Appliances, Electric Mobility, etc., Computer Aided Simulation and Design of Advanced Electrical Machines, Case Studies.",
            "prereqs_parsed": [
                [
                    "ELL203"
                ]
            ],
            "type": "DE"
        },
        {
            "code": "ELL402",
            "name": "Computer Communication",
            "prereqs": "[MEL250]",
            "overlap": "ELL785, COL334",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "(i) Introduction, network structure: Basic networking concepts, Motivations for layered network concepts, Network examples; (ii) oSI reference model: Layering concepts, overview of different layer functionalities; (iii) TCP/IP: Layering concepts, Layered functionalities, packet formats, fragmentation, Different layer protocols and examples: ARP, ICMP, etc., Congestion and error control; (iv) Network examples and functionalities: Ethernet, hub, bridge, switch, WANs, MANs, LANs, PANs, BANs; (v) Basic network protocol analysis: Performance metrics, Queueing models; (vi) Multiaccess protocols: Need for multiaccess protocols, Contention-free access schemes, Contention-based protocols: ALoHA, CSMA; (vii) Routing in data networks: Basic graph theoretic concepts, spanning tree, Shortest path routing, distance vector routing, link state routing, RIP, oSPF; (viii) Cross-layer protocol optimization concepts: Distributed control, cost and energy efficiencies.",
            "prereqs_parsed": [
                [
                    "MEL250"
                ]
            ],
            "type": "DE"
        },
        {
            "code": "ELL405",
            "name": "Operating Systems",
            "prereqs": "[ELL305]",
            "overlap": "COL331, MTL458, ELL783",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Introduction to oS; Process and Thread management; Scheduling; Concurrent threads  and  processes: mutual exclusion, synchronization, inter-process communication; Memory management: Cache and Virtual  Memory management; Resource management: deadlock and its prevention; File management; I/o management; Introduction to real time systems; Elements distributed operating systems.",
            "prereqs_parsed": [
                [
                    "ELL305"
                ]
            ],
            "type": "DE"
        },
        {
            "code": "ELL406",
            "name": "Robotics and Automation",
            "prereqs": "[ELL225]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Introduction to robotics. Basic components of robotic systems. Coordinate Transformation, D-H parameters. Forward and inverse kinematics. Velocity kinematics and Jacobian, Singularity analysis, Robot Dynamics : Holonomic and Non-Holonomic Systems. Trajectory planning. Robot control: linear and nonlinear. Actuators and Sensors. Vision based Robotic Control. Mobile Robots : Modeling and Control.",
            "prereqs_parsed": [
                [
                    "ELL225"
                ]
            ],
            "type": "DE"
        },
        {
            "code": "ELL409",
            "name": "Machine Intelligence and Learning",
            "prereqs": "[MTL106 and COL106]",
            "overlap": "ELL784, ELL789, COL341/COL774",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 2
            },
            "description": "Introduction to machine intelligence and intelligent agents; problem solving; knowledge representation and reasoning (logical and probabilistic); need for learning; basics of machine learning; Decision Trees; Rule-based models; linear learning models; Support Vector Machines; Artificial Neural Networks; Deep Learning; Probabilistic Modelling; Naive Bayes; Reinforcement Learning; Clustering; Feature Selection; Principal Component Analysis; Combining models; Philosophical issues in intelligence and learning. Substantive implementation assignments or a term project involving design of an intelligent learning-based system.",
            "prereqs_parsed": [
                [
                    "MTL106",
                    "COL106"
                ]
            ],
            "type": "DE"
        },
        {
            "code": "ELL410",
            "name": "Multicore Systems",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Motivation for muticores; Multithreading; Flynn’s taxonomy; Stream processing (vectVLIW, GPu). Message passing; Shared memory; Cache coherence in multiprocessor Synchronisation; Interconnection networks; Benchmarks and advanced topics; Project.",
            "prereqs_parsed": [],
            "type": "DE"
        },
        {
            "code": "ELL411",
            "name": "Digital Communications",
            "prereqs": "[ELL311]",
            "overlap": "ELL712",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 2
            },
            "description": "Matched Filter, Error Rate due to Noise. Intersymbol Interference, Nyquist’s Criterion, Duobinary Signaling. optimum Linear Receiver, Geometric Representation of Signals. Coherent Detection of Signals in Noise, Probability of Error. Coherent Digital Modulation Schemes: MPSK, MFSK, MQAM; Error Analysis. Noncoherent FSK, Differential PSK. Comparison of Digital Modulation Schemes, Bandwidth Efficiency. Pseudo-Noise Sequences and Spread Spectrum, Trellis coded modulation, Digital signaling over fading multipath channels, oFDM communications systems.",
            "prereqs_parsed": [
                [
                    "ELL311"
                ]
            ],
            "type": "DE"
        },
        {
            "code": "ELL703",
            "name": "Optimal Control Theory",
            "prereqs": "[ELL700 or ELL333]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Maximization of functionals of a single and several functions using calculus of variations, Constrained extremals, Euler-Lagrange Equation, Necessary conditions for optimal control, Pontryagin’s minimum principle and state inequality constraints, Minimum time problems, Minimum control effort problems, Linear quadratic regulator problems, Riccati Equation, Singular intervals in optimal control problems, The principle of optimality, Application of the principle of optimality to decision making, Dynamic programming applied to routing problems,  Solving optimal control problems using dynamic programming, Discrete linear regulator problem, Hamilton -Jacobi -Bellman Equation, Numerical Techniques to determine optimal trajectories.",
            "prereqs_parsed": [
                [
                    "ELL700",
                    "ELL333"
                ]
            ],
            "type": "DE"
        },
        {
            "code": "ELL710",
            "name": "Coding Theory",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Measure of information, Source coding, Communication channel models, Channel Capacity and coding, Linear Block codes, Low Density Parity Check (LDPC) Codes, Bounds on minimum distance, Cyclic codes, BCH codes, Reed Solomon Codes, Convolutional codes, Trellis coded Modulation, Viterbi decoding, Turbo codes, Introduction to Space-Time Codes and Introduction to Cryptography. If time permits, LDPC/Turbo codes in the wireless standards. There are no laboratory or design activities involved with this course.",
            "prereqs_parsed": [],
            "type": "DE"
        },
        {
            "code": "ELL715",
            "name": "Digital Image Processing",
            "prereqs": "[]",
            "overlap": "",
            "credits": 4.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 2
            },
            "description": "Introduction to 2-D Signals and Systems. Image Digitization. Image Transforms. Image Enhancement: Image Restoration: Inverse Filtering, Algebraic Approach to Restoration, Wiener (LMS) approach, Constrained Least Squares Restoration, Adaptive methods for restoration. Image Reconstruction: The Filtered Back- Projection Algorithm, Algebraic Reconstruction Method. Image Segmentation: Detection of Discontinuities, Edge Linking and Boundary Detection, Thresholding, Region-oriented Segmentation. object representation and description: Boundary descriptors, region descriptors, HoG and SIFT based features. Colour Image processing: colour models, colour transformations, and processing techniques.",
            "prereqs_parsed": [],
            "type": "DE"
        },
        {
            "code": "ELL716",
            "name": "Telecommunication Switching and Transmission",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Wireline access circuits, long haul circuits, signaling, switching exchanges, analysis of telecom switching networks, teletraffic engineering, management protocols, multi-service telecom protocols and networks.",
            "prereqs_parsed": [],
            "type": "DE"
        },
        {
            "code": "ELL724",
            "name": "Multichannel Signal Processing",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Wave Propagation: Wave equation, plane and spherical wave solution in Cartesian co-ordinate system, wave solution in spherical co-ordinate system, Introduction of Spherical Harmonics. Mathematical Preliminaries of ASP: Linear Algebra Basics, Array Signal Processing Basics, optimization Algorithms. Acoustic Source Localization: Data model, correlation and subspace based (MuSIC, root-MuSIC) localization, wideband and narrowband source localization. Source activity detection, Localization and Tracking. Brain Source Localization for BCI Control: Introduction of Head harmonics for brain source localization (BSL), Application of BSL in BCI control, and physiological shape description for medical application. Source Estimation: Fixed beamforming, Null steering, adaptive beamforming, Beampattern Design: Robust/non-robust, Frequency invariant, least square, Joint optimization. Multichannel Signal Enhancement: Time and frequency domain-based enhancement, Joint Diagonalization, Noise rejection, Binary Masking and beamforming. More Application: Source separation, Dereverberation",
            "prereqs_parsed": [],
            "type": "DE"
        },
        {
            "code": "ELL725",
            "name": "Wireless Communications",
            "prereqs": "[ELL712]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "The wireless channel (physical modeling, linear time-varying system, discrete-time baseband model, time and frequency coherence), point- to-point communication (detection, diversity, spatial multiplexing), cellular systems (multiple access and interference management), capacity of point-to-point wireless channels (single and multi- antenna), capacity of single-antenna multiuser channels, point- to-point multi-antenna (MIMo) channels and spatial multiplexing, point-to-point MIMo capacity and multiplexing architectures.",
            "prereqs_parsed": [
                [
                    "ELL712"
                ]
            ],
            "type": "DE"
        },
        {
            "code": "ELL730",
            "name": "I.C. Technology",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Course Introduction, Modern Semiconductor IC fabrication Industrial/ Academic Landscape; Overview of modern CMOS process flow – basic steps; Crystal growth and wafer basics; Cleanroom basics – environment, infrastructure, advanced MoS cleaning, getering etc. Lithography; oxidation; Diffusion; Ion-Implantation; Thin-Film Deposition; Etching; Backend processes; Process Simulation- tools, techniques and methods; Advanced device fabrication concepts – I (SoI, FDSoI, etc); Advanced device fabrication concepts – II (organic, PV, hetero); Advanced device fabrication concepts – III (CNTs, Self-assembly etc).",
            "prereqs_parsed": [],
            "type": "DE"
        },
        {
            "code": "ELL738",
            "name": "Micro and Nano Photonics",
            "prereqs": "[PYL101]",
            "overlap": "PYL795",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Ray optics; Wave optics: Plane Waves, Spherical Waves, Interference, Diffraction; Paraxial Waves; Beam optics; Fabry Perot Cavity; Microresonators - Ring Resonators, Disc Resonators; Review of Electromagnetic (EM) Theory; Boundary Conditions; and some relevant EM problems; FDTD and FEM modeling; Fundamentals of Plasmonics - Surface Plasmon Resonance, Dispersion relation, Plasmon coupling conditions, Plasmonic gratings, Models describing the refractive index of metals; Localized Surface Plasmon Resonance; Plasmonic Sensors and Devices; Surface-enhanced Raman Scattering; Plasmonic waveguides and Interconnects; Photonic Crystals and Devices.",
            "prereqs_parsed": [
                [
                    "PYL101"
                ]
            ],
            "type": "DE"
        },
        {
            "code": "ELL740",
            "name": "Compact Modeling of Semiconductor Devices",
            "prereqs": "[(MoS or Microelectronics) and any]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "or Physical Electronics or VLSI technology Introduction to AMS enablement and PDK elements, Basics of semiconductor devices, Device modeling tools-TCAD and SPICE, Diode modeling, Resistor modeling, FEoL capacitor modeling, Advanced CMoS Technology, MoS transistor modeling, modeling of process variations, Mismatch and corners.",
            "prereqs_parsed": [],
            "type": "DE"
        },
        {
            "code": "ELL758",
            "name": "Power Quality",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Overview and definition of power quality (PQ), Sources of pollution, International power quality standards, and regulations. Power quality monitoring. Power quality problems. Loads which causes power quality problems. Power factor correction, zero voltage regulation, reactive power compensation, load balancing using load compensation techniques: passive shunt and series compensation, DSTATCoM (Distribution Static Compensators), DVR (Dynamic Voltage Restorers), uPQC (universal Power Quality Conditioners). Harmonic effects- within the power system, interference with communication Harmonic measurements. Harmonic elimination-using active (shunt, series and hybrid) and passive (shunt and series) filters. Improved power quality converters: single ac-dc converters, bridgeless isolated converter, bridgeless non-isolated converters, multi-pulse converters, multilevel converters, line commutated converters, power quality improvement in SMPS, uPS, drives, welding systems, lighting systems, and renewable energy systems.",
            "prereqs_parsed": [],
            "type": "DE"
        },
        {
            "code": "ELL765",
            "name": "Smart Grid Technology",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 3,
                "tutorial": 0,
                "practical": 0
            },
            "description": "Introduction:- Smart Grid an overview; Components of Smart Grid; Intelligent Appliances; Smart Substations; Smart Distributions- Generations; Smart Power meters; universal Access (wind, solar, hydro etc.) Smart Grid Technologies:  Integrated Communications; Sensing and Measurement; Advance Control Methods; Advance components and Improved Interfaces and Decision Support. Benefits of Smart Grid: Self-Healing; Power Quality Improvement; utilization of all generation and storage options; optimized use of assets and efficient Operation. Miscellaneous: Smart Grid Challenges; Smart Grid Projects; Contribution of Microgrid in development of Smart Grid.",
            "prereqs_parsed": [],
            "type": "DE"
        },
        {
            "code": "ELS310",
            "name": "Independent Study (EE1)",
            "prereqs": "[]",
            "overlap": "",
            "credits": 3.0,
            "hours": {
                "lecture": 0,
                "tutorial": 3,
                "practical": 0
            },
            "description": "",
            "prereqs_parsed": [],
            "type": "DE"
        },
        {
            "code": "ELP101",
            "name": "Introduction to Electrical Engineering",
            "prereqs": "[]",
            "overlap": "",
            "credits": 0,
            "hours": {
                "lecture": 0,
                "tutorial": 0,
                "practical": 0
            },
            "description": "(Laboratory) 1 Credit (0-0-2) CRO (mechanism and usage). KCL, KVL, Network theorem verification. Step/transient response of RL, RC, RLC, circuits. Steady state response of Circuits of sinusoidal excitation. Diode experiment (clipping, clamping and rectification). Basic circuits using opamp. Transformers oC and SC tests. BH loop in an iron core, DC and AC motor – for observation only. A small mini-project.",
            "prereqs_parsed": [],
            "type": "Core"
        },
        {
            "code": "PYP100",
            "name": "Physics Laboratory",
            "prereqs": "[]",
            "overlap": "",
            "credits": 2.0,
            "hours": {
                "lecture": 0,
                "tutorial": 0,
                "practical": 4
            },
            "description": "Experiments based on Design and Study of Power sources, Charging and discharging of a capacitor, Electromagnetic Induction, Phase Measurement. Experiments on geometrical and wave optics including interference, diffraction, dispersion and polarization. Experiments based on mechanics, heat, sound, fluids, resonance, like linear air track, coupled pendulum and oscillators, thermal conductivity, elasticity. Experiments in the area of modern physics, like Planck’s constant, lasers, semiconductor band gap, wave motion, mechanical transmission lines.",
            "prereqs_parsed": [],
            "type": "Core"
        },
        {
            "code": "MCP101",
            "name": "Product Realization through Manufacturing",
            "prereqs": "[]",
            "overlap": "",
            "credits": 2.0,
            "hours": {
                "lecture": 0,
                "tutorial": 0,
                "practical": 4
            },
            "description": "Exposing role of manufacturing processes in product realization; understanding product realization by endeavouring hands on activities; Experience of product realization by undertaking manufacturing exercises and assembly activity in teams.",
            "prereqs_parsed": [],
            "type": "Core"
        }
    ]
}